package com.mo_said.azkar.DB;

import com.mo_said.azkar.ModelAzkar_cc;
import com.mo_said.azkar.ModelElseb7a;
import com.mo_said.azkar.ModelRvHome;
import com.mo_said.azkar.R;
import com.mo_said.azkar.RV.Model;

import java.util.ArrayList;

public class DB {
    // Ad3ia item  Data
    public ArrayList<Model> ad3ia_0() {

        ArrayList<Model> ad3ia_0 = new ArrayList<>();
        ad3ia_0.add(new Model("اللَّهُمَّ أنَْتَ رَبيِّ لَا إلِهََ إلَِّا أنَتَ، خَلَقْتنَيِ وَأنََا عَبدُْكَ، وَأنََا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ. ", "رواه البخاري (6306) عن شداد بن أوس وقد وصف النبي هذا الدعاء بأنه سيد الاستغفار."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّك أَنْتَ الْغَفُورُ الرَّحِيمُ. ", "رواه البخاري (834) ومسلم (6869) عن أبي بكر."));
        ad3ia_0.add(new Model("رَبِّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي كُلِّهِ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي خَطَايَايَ وَعَمْدِي وَجَهْلِي وَهَزْلِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. ", "رواه البخاري (6398) ومسلم (6901) عن أبي موسى."));
        ad3ia_0.add(new Model("اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ، وَجِلَّهُ، وَأَوَّلَهُ، وَآخِرَهُ، وَعَلَانِيَتَهُ، وَسِرَّهُ. ", "رواه مسلم (1084) عن أبي هريرة."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ. ", "رواه البخاري (6369) عن أنس."));
        ad3ia_0.add(new Model("اللَّهُمَّ إنِِّي أَعُوذُ بكَِ مِنَ الْبُخْلِ، وَأَعُوذُ بكَِ مِنَ الْجُبْنِ، وَأَعُوذُ بكَِ أَنْ أُرَدَّ إلَِى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ. ", "رواه البخاري (6365) عن سعد بن أبي وقاص."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ، وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ. ", "رواه البخاري (6368) ومسلم (6871) عن عائشة."));
        ad3ia_0.add(new Model("اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتهِِ، اللَّهُمَّ أَنْتَ الْأوََّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ. ", "رواه مسلم (6889) عن أبي هريرة."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ. ", "رواه مسلم (6895) عن عائشة."));
        ad3ia_0.add(new Model("اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ. ", "رواه مسلم (6903) عن أبي هريرة."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى. ", "رواه مسلم (6904) عن ابن مسعود."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَالْهَرَمِ وَعَذَابِ الْقَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا. ", "رواه مسلم (6906) عن زيد بن أرقم."));
        ad3ia_0.add(new Model("اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ، اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لَا إِلَهَ إِلَّا أَنْتَ أَنْ تُضِلَّنيِ، أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ. ", "رواه البخاري (7383) ومسلم (6899) عن ابن عباس."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ. ", "رواه مسلم (6943) عن ابن عمر."));
        ad3ia_0.add(new Model("اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ. ", "رواه مسلم (6750) عن عبد الله بن عمرو."));
        ad3ia_0.add(new Model("اللَّهُمَّ رَبَّ جَبْرَائِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ. ", "رواه مسلم (1811) عن عائشة."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ. ", "رواه مسلم (1090) عن عائشة."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ. ", "رواه البخاري (6347) ومسلم (6877) عن أبي هريرة."));
        ad3ia_0.add(new Model("اللَّهُمَّ اجْعَلْ لِي فِي قَلْبِي نُورًا، وَفِي لِسَانِي نُورًا، وَفِي سَمْعِي نُورًا، وَفِي بَصَرِي نُورًا، وَمِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ شِمَالِي نُورًا، وَمِنْ بَيْنِ يَدَيَّ نُورًا، وَمِنْ خَلْفِي نُورًا، وَاجْعَلْ فِي نَفْسِي نُورًا، وَأَعْظِمْ لِي نُورًا. ", "رواه البخاري (6316) ومسلم (1797) عن ابن عباس."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَم،ْ وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا. ", "رواه ابن ماجه (3846) بإسناد صحيح عن عائشة."));
        ad3ia_0.add(new Model("اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى، وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ. ", "رواه النَّسائي (1305) بإسناد حسن عن عمار بن ياسر."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، وَاحْفَظنْيِ مِنْ بيَنِْ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينيِ وَعَنْ شِمَاليِ وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي. ", "رواه أبو داود (5074) وغيره بإسناد صحيح عن ابن عمر."));
        ad3ia_0.add(new Model("اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ. ", "رواه الترمذي (3392) وغيره بإسناد صحيح عن أبي هريرة."));
        ad3ia_0.add(new Model("اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتكَِ، وَعَزَائمَِ مَغْفِرَتكَِ، وَأسَْألَكَُ شُكْرَ نعِْمَتكَِ، وَحُسْنَ عِباَدَتكَِ، وَأسَْألَكَُ قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ. ", "رواه الطبراني في \"الكبير\" (7135) عن شداد بن أوس."));
        ad3ia_0.add(new Model("اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ. ", "رواه الترمذي (3563) بإسناد حسن عن علي."));
        ad3ia_0.add(new Model("اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إلَِهَ إلَِّا أَنْتَ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ. ", "رواه أبو داود (5090) بإسناد حسن عن أبي بكرة."));
        ad3ia_0.add(new Model("رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَل َاتَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الْهُدَى لِي، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ، رَبِّ اجْعَلْنِي لَكَ شَكَّارًا، لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مِطْوَاعًا، لَكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا، رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ صَدْرِي. ", "رواه الترمذي (3551) وغيره بإسناد صحيح عن ابن عباس."));
        ad3ia_0.add(new Model("اللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ، اللَّهُمَّ لَا قَابِضَ لِمَا بَسَطْتَ، وَلَا بَاسِطَ لِمَا قَبَضْتَ، وَلَا هَادِيَ لِمَا أَضْلَلْت، وَلَا مُضِلَّ لِمَنْ هَدَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُقَرِّبَ لِمَا بَاعَدْتَ، وَلَا مُبَاعِدَ لِمَا قَرَّبْتَ، اللَّهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ الْعَيْلَةِ، وَالْأَمْنَ يَوْمَ الْخَوْفِ، اللَّهُمَّ إنِِّي عَائذٌِ بكَِ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَ، اللَّهُمَّ حَبِّبْ إلَِيْنَا الْإِيمَانَ وَزَيِّنْهُ فيِ قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ، اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ، وَأَحْيِنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلَا مَفْتُونِينَ، اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ، وَيَصُدُّونَ عَنْ سَبِيلِكَ، وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ، اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَهَ الْحَقِّ. ", "رواه الإمام أحمد (15492) عن رفاعة الزرقي بإسناد صحيح."));
        ad3ia_0.add(new Model("اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللّٰهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ. ", "رواه البخاري (3370) ومسلم (908) عن كعب بن عُجرة."));

        return ad3ia_0;
    }

    public ArrayList<Model> ad3ia_1() {
        ArrayList<Model> ad3ia_1 = new ArrayList<>();
        ad3ia_1.add(new Model("\"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّار\"ِ", "[البقرة - 201]."));
        ad3ia_1.add(new Model("\"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ\"", ""));
        ad3ia_1.add(new Model("\"رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ\".", "[البقرة - 286]."));
        ad3ia_1.add(new Model("\"رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ\".", "[آل عمران - 8]."));
        ad3ia_1.add(new Model("\"رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ\".", "[آل عمران - 16]."));
        ad3ia_1.add(new Model("\"رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء\"", "[آل عمران - 38]."));
        ad3ia_1.add(new Model("\"رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ\".", "[آل عمران - 53]."));
        ad3ia_1.add(new Model("\"ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَِ\".", "[آل عمران - 147]."));
        ad3ia_1.add(new Model("\"رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ\".", "[آل عمران -  191-194]."));
        ad3ia_1.add(new Model("\"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ\".", "[الأعراف - 23]."));
        ad3ia_1.add(new Model("\"رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ\".", "[الأعراف - 47]."));
        ad3ia_1.add(new Model("\"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ\".", "[الأعراف - 126]."));
        ad3ia_1.add(new Model("\"حَسْبِيَ اللّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ\".", "[التوبة - 129]."));
        ad3ia_1.add(new Model("\"رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ\".", "[يونس - 85-86]."));
        ad3ia_1.add(new Model("\"رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ\".", "[هود - 47]."));
        ad3ia_1.add(new Model("\"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء\".", "[إبرهيم - 40]."));
        ad3ia_1.add(new Model("\"رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ\".", "[إبرهيم - 41]."));
        ad3ia_1.add(new Model("\"رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا\".", "[الإسراء - 80]."));
        ad3ia_1.add(new Model("\"رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا\".", "[الكهف - 10]."));
        ad3ia_1.add(new Model("\"رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي\".", "[طه - 25-28]."));
        ad3ia_1.add(new Model("\"رَّبِّ زِدْنِي عِلْمًا\". ", "[طه - 114]."));
        ad3ia_1.add(new Model("\"لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ\".", "[الأنبياء - 87]."));
        ad3ia_1.add(new Model("\"رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ\".", "[الأنبياء - 89]."));
        ad3ia_1.add(new Model("\"رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ\".", "[المؤمنون - 97-98]."));
        ad3ia_1.add(new Model("\"رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ\".", "[المؤمنون - 109]."));
        ad3ia_1.add(new Model("\"رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ\".", "[المؤمنون - 118]."));


        return ad3ia_1;

    }

    public ArrayList<Model> ad3ia_2() {
        ArrayList<Model> ad3ia_2 = new ArrayList<>();

        ad3ia_2.add(new Model("\"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ\". [الأعراف - 23].", "آدم علية السلام."));
        ad3ia_2.add(new Model("\"رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا\". [نوح - 28].\n" +
                "\n" +
                "\" رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ\". [هود - 47].\n" +
                "\n" +
                "\"رَّبِّ أَنزِلْنِي مُنزَلاً مُّبَارَكاً وَأَنتَ خَيْرُ الْمُنزِلِينَ\". [المؤمنون - 29].", "نوح علية السلام.\n"));


        ad3ia_2.add(new Model("\"رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ (127) رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ (128)\". [البقرة - 127-128].\n" +
                "\n" +
                "\"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ (40) رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ (41)\". [إبراهيم - 40-41].\n" +
                "\n" +
                "\"رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ (83) وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ (84) وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ (85)\". [الشعراء - 83-85].\n" +
                "\n" +
                "\"رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ (4) رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ  إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ (5)\". [الممتحنة - 4-5].\n" +
                "\n" +
                "\"رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ\". [الصافات - 100].", "إبراهيم علية السلام."));
        ad3ia_2.add(new Model("\"إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم ۚ مَّا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ\". [هود - 56].", "هود علية السلام."));

        ad3ia_2.add(new Model("\"رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ\". [العنكبوت - 30].\n" +
                "\n" +
                "\"رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ\". [الشعراء - 169].", "لوط علية السلام."));
        ad3ia_2.add(new Model("\"فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ\". [يوسف - 101].", "يوسف علية السلام."));
        ad3ia_2.add(new Model("\"وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْماً عَلَى اللّهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ\". [الأعراف - 89].\n" +
                "\n", "شعيب علية السلام."));
        ad3ia_2.add(new Model("\"رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي\". [القصص - 16].\n" +
                "\n" +
                "\"رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيراً لِّلْمُجْرِمِينَ\". [القصص - 17].\n" +
                "\n" +
                "\"رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ\". [القصص - 24].\n" +
                "\n" +
                "\"رَبِّ اشْرَحْ لِي صَدْرِي (25) وَيَسِّرْ لِي أَمْرِي (26) وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي (27) يَفْقَهُوا قَوْلِي (28)\". [طه - 25-28].", "موسى علية السلام."));
        ad3ia_2.add(new Model("\"أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ\". [الأنبياء - 83].\n" +
                "\n", "أيوب علية السلام."));
        ad3ia_2.add(new Model("\"رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ\". [النمل - 19].\n" +
                "\n", "سليمان علية السلام."));
        ad3ia_2.add(new Model("\" لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ\". [الأنبياء - 87].\n" +
                "\n", "يونس علية السلام."));
        ad3ia_2.add(new Model("\"رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء\". [آل عمران - 38].\n" +
                "\n" +
                "\"رَبِّ لَا تَذَرْنِي فَرْداً وَأَنتَ خَيْرُ الْوَارِثِينَ\". [الأنبياء - 89].\n" +
                "\n", "زكريا علية السلام."));
        ad3ia_2.add(new Model("\"إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ\". [يوسف - 86].\n" +
                "\n", "يعقوب علية السلام."));


        return ad3ia_2;
    }

    public ArrayList<Model> ad3ia_3() {
        ArrayList<Model> ad3ia_3 = new ArrayList<>();

        ad3ia_3.add(new Model("أدعية للمتوفى (ذكور)\n" +
                "\n" +
                "اللَّهُمَّ أبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وأدخله الجنّة، وأعذه من عذاب القبر ومن عذاب النّار.\n\n" +
                "" +
                "اللَّهُمَّ عامله بما أنت أهله، ولا تعامله بما هو أهله.\n" +
                "\n" +
                "اللَّهُمَّ اجزه عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً.\n" +
                "\n" +
                "اللَّهُمَّ إن كان محسناً فزد من حسناته، وإن كان مسيئاً فتجاوز عن سيّئاته.\n" +
                "\n" +
                "اللَّهُمَّ أدخله الجنّة من غير مناقشة حساب ولا سابقة عذاب.\n" +
                "\n" +
                "اللَّهُمَّ آنسه في وحدته وفي وحشته وفي غربته.\n" +
                "\n" +
                "اللَّهُمَّ أنزله منزلاً مباركاً وأنت خير المنزلين.\n" +
                "\n" +
                "اللَّهُمَّ أنزله منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً.\n" +
                "\n" +
                "اللَّهُمَّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.\n" +
                "\n" +
                "اللَّهُمَّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة.\n" +
                "\n" +
                "اللَّهُمَّ أعذه من عذاب القبر، وجفاف ِالأرض عن جنبيها.\n" +
                "\n" +
                "اللَّهُمَّ املأ قبره بالرّضا والنّور والفسحة والسّرور.\n" +
                "\n" +
                "اللَّهُمَّ إنّه في ذمّتك وحبل جوارك، فقِهِِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه إنّك أنت الغفور الرّحيم.\n" +
                "\n" +
                "اللَّهُمَّ إنّه عبدك وابن عبدك خرج من الدّنيا وسعتها ومحبوبها وأحبّائه فيها إلى ظلمة القبر وما هو لاقيه.\n" +
                "\n" +
                "اللَّهُمَّ إنّه كان يشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به.\n" +
                "\n" +
                "اللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السؤال.\n" +
                "\n" +
                "اللَّهُمَّ إنّه نَزَل بك وأنت خير منزولٍ به، وأصبح فقيراً إلى رحمتك وأنت غنيٌّ عن عذابه.\n" +
                "\n" +
                "اللَّهُمَّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين.\n" +
                "\n" +
                "اللَّهُمَّ انقله من مواطن الدّود وضيق اللحود إلى جنّات الخلود.\n" +
                "\n" +
                "اللَّهُمَّ احمه تحت الأرض، واستره يوم العرض، ولا تخزه يوم يبعثون \"يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم\".\n" +
                "\n" +
                "اللَّهُمَّ يمّن كتابه، ويسّر حسابه، وثقّل بالحسنات ميزانه، وثبّت على الصّراط أقدامه، وأسكنه في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم).\n" +
                "\n" +
                "اللَّهُمَّ أمّنه من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسه آمنة مطمئنّة، ولقّنه حجّته.\n" +
                "\n" +
                "اللَّهُمَّ اجعله في بطن القبر مطمئنّاً وعند قيام الأشهاد آمن، وبجود رضوانك واثق، وإلى أعلى درجاتك سابق.\n" +
                "\n" +
                "اللَّهُمَّ اجعل عن يمينه نوراً حتّى تبعثه آمناً مطمئنّاً في نورٍ من نورك.\n" +
                "\n" +
                "اللَّهُمَّ انظر إليه نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً.\n" +
                "\n" +
                "اللَّهُمَّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم.\n" +
                "\n" +
                "اللَّهُمَّ اعف عنه فإنّك القائل \"ويعفو عن كثير\".\n" +
                "\n" +
                "اللَّهُمَّ إنّه جاء ببابك، وأناخ بجنابك، فَجد عليه بعفوك وإكرامك وجود إحسانك.\n" +
                "\n" +
                "اللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمه رحمةً تطمئنّ بها نفسه، وتقرّ بها عينه.\n" +
                "\n" +
                "اللَّهُمَّ احشره مع المتّقين إلى الرّحمن وفداً.\n" +
                "\n" +
                "اللَّهُمَّ احشره مع أصحاب اليمين، واجعل تحيّته سلامٌ لك من أصحاب اليمين.\n" +
                "\n" +
                "اللَّهُمَّ بشّره بقولك \"كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية\".\n" +
                "\n" +
                "اللَّهُمَّ اجعله من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض.\n" +
                "\n" +
                "اللَّهُمَّ لا نزكّيه عليك، ولكنّا نحسبه أنّه أمن وعمل صالحاً، فاجعل له جنّتين ذواتي أفنان بحقّ قولك: \"ولمن خاف مقام ربّه جنّتان\".\n" +
                "\n" +
                "اللَّهُمَّ شفع فيه نبيّنا ومصطفاك، واحشره تحت لوائه، واسقه من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً.\n" +
                "\n" +
                "اللَّهُمَّ اجعله في جنّة الخلد \"الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا\".\n" +
                "\n" +
                "اللَّهُمَّ إنّه صبر على البلاء فلم يجزع، فامنحه درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل \"إنّما يوفي الصّابرون أجرهم بغير حساب\".\n" +
                "\n" +
                "اللَّهُمَّ إنّه كان مصلّ لك، فثبّته على الصّراط يوم تزل الأقدام.\n" +
                "\n" +
                "اللَّهُمَّ إنّه كان صائماً لك، فأدخله الجنّة من باب الريّان.\n" +
                "\n" +
                "اللَّهُمَّ إنّه كان لكتابك تالٍ وسامع، فشفّع فيه القرآن، وارحمه من النّيران، واجعله يا رحمن يرتقي في الجنّة إلى آخر آية قرأها أو سمعها، وآخر حرفٍ تلاه.\n" +
                "\n" +
                "اللَّهُمَّ ارزقه بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ اّية سعادة، وبكلّ سورة سلامة، وبكل جْزءٍ جزاء.\n" +
                "\n" +
                "اللَّهُمَّ ارحمه فإنّه كان مسلماً، واغفر له فإنّه كان مؤمناً، وأدخله الجنّة فإنّه كان بنبيّك مصدّقاً، وسامحه فإنّه كان لكتابك مرتّلاً.\n" +
                "\n" +
                "اللَّهُمَّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنَا وأنثانا.\n" +
                "\n" +
                "اللَّهُمَّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان.\n" +
                "\n" +
                "اللَّهُمَّ لا تحرمنا أجره ولا تضللنا بعده.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا يئس منّا الطبيب، وبكى علينا الحبيب، وتخلّى عنّا القريب والغريب، وارتفع النّشيج والنّحيب.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ، وبلغتِ التراقِ، وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ، إليك يا ربَّنا يومئذٍ المساق.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا ورينا التّراب، وغلقت القبور والأبواب، وانفضّ الأهل والأحباب، فإذا الوحشة والوحدة وهول الحساب.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا فارقنا النّعيم، وانقطع النّسيم، وقيل ما غرّك بربّك الكريم.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا أقمنا للسؤال، وخاننا المقال، ولم ينفع جاهٌ ولامال ولا عيال، وقد حال الحال، وليس إلّا فضل الكبير المتعال.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا نَسي اسمنا، ودَرس رسمنا، وأحاط بنا قسمنا ووسعنا.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر، ولم يذكرنا ذاكر، وما لنا من قوّة ولا ناصر، فلا أمل إلّا في القاهر القادر الغافر، يا من إذا وعد أوفى، وإذا توعّد عفا، وشفّع يا ربّ فينا حبيبنا المصطفى، واجعلنا ممّن صفا ووفا، وبالله اكتفى، يا أرحم الرّاحمين، يا حيّ يا قيّوم، يا بديع السموات والأرض، يا ذا الجلال والإكرام.\n" +
                "\n" +
                "اللَّهُمَّ إنّه عبدك وابن عبدك وابن أمتك مات وهو يشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر له إنّك أنت الغفّار.\n" +
                "\n" +
                "اللَّهُمَّ لا تحرمنا أجره، ولا تفتنّا بعده، واغفر لنا وله، واجمعنا معه في جنّات النّعيم يا ربّ العالمين.\n" +
                "\n" +
                "اللَّهُمَّ أنزل على أهله الصّبر والسلوان وارضهم بقضائك.\n" +
                "\n" +
                "اللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد.\n" +
                "\n" +
                "اللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى اّله وصحبه وسلّم إلى يوم الدّين.", ""));
        ad3ia_3.add(new Model("أدعية للمتوفية (إناث)\n" +
                "\n" +
                "اللَّهُمَّ أبدلها داراً خيراً من دارها، وأهلاً خيراً من أهلها، وأدخلها الجنّة، وأعذها من عذاب القبر ومن عذاب النّار.\n" +
                "\n" +
                "اللَّهُمَّ عاملها بما أنت أهله، ولا تعاملها بما هى أهله.\n" +
                "\n" +
                "اللَّهُمَّ اجزها عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً.\n" +
                "\n" +
                "اللَّهُمَّ إن كانت محسنةً فزد من حسناتها، وإن كان مسيئةً فتجاوز عن سيّئاتها.\n" +
                "\n" +
                "اللَّهُمَّ أدخلها الجنّة من غير مناقشة حساب ولا سابقة عذاب.\n" +
                "\n" +
                "اللَّهُمَّ اّنسها في وحدتها وفي وحشتها وفي غربتها.\n" +
                "\n" +
                "اللَّهُمَّ أنزلها منزلاً مباركاً وأنت خير المنزلين.\n" +
                "\n" +
                "اللَّهُمَّ أنزلها منازل الصدّيقين والشّهداء والصّالحين، وحسن أولئك رفيقاً.\n" +
                "\n" +
                "اللَّهُمَّ اجعل قبرها روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار.\n" +
                "\n" +
                "اللَّهُمَّ افسح لها في قبرها مدّ بصرها، وافرش قبرها من فراش الجنّة.\n" +
                "\n" +
                "اللَّهُمَّ أعذها من عذاب القبر، وجفاف ِالأرض عن جنبيها.\n" +
                "\n" +
                "اللَّهُمَّ املأ قبرها بالرّضا والنّور والفسحة والسّرور.\n" +
                "\n" +
                "اللَّهُمَّ إنّها في ذمّتك وحبل جوارك، فقِهِا فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر لهه وارحمها إنّك أنت الغفور الرّحيم.\n" +
                "\n" +
                "اللَّهُمَّ إنها أمتك وبنت أمتك خرجت من الدّنيا وسعتها ومحبوبيها وأحبائها فيها إلى ظلمة القبر وما هى لاقته.\n" +
                "\n" +
                "اللَّهُمَّ إنّها كانت تشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به.\n" +
                "\n" +
                "اللَّهُمَّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمها ولا تعذّبها، وأن تثبّتها عند السؤال.\n" +
                "\n" +
                "اللَّهُمَّ إنّها نَزَلت بك وأنت خير منزولٍ به، وأصبحت فقيرةً إلى رحمتك وأنت غنيٌّ عن عذابها.\n" +
                "\n" +
                "اللَّهُمَّ آتها برحمتك ورضاك، وقهِا فتنة القبر وعذابه، وآتها برحمتك الأمن من عذابك حتّى تبعثها إلى جنّتك يا أرحم الرّاحمين.\n" +
                "\n" +
                "اللَّهُمَّ انقلها من مواطن الدّود وضيق اللحود إلى جنّات الخلود.\n" +
                "\n" +
                "اللَّهُمَّ احمها تحت الأرض، واسترها يوم العرض، ولا تخزها يوم يبعثون “يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم”.\n" +
                "\n" +
                "اللَّهُمَّ يمّن كتابها، ويسّر حسابها، وثقّل بالحسنات ميزانها، وثبّت على الصّراط أقدامها، وأسكنها في أعلى الجنّات بجوار حبيبك ومصطفاك (صلّى الله عليه وسلّم).\n" +
                "\n" +
                "اللَّهُمَّ أمّنها من فزع يوم القيامة، ومن هول يوم القيامة، واجعل نفسها آمنة مطمئنّة، ولقّنها حجّتها.\n" +
                "\n" +
                "اللَّهُمَّ اجعلها في بطن القبر مطمئنّةً وعند قيام الإشهاد آمنةً، وبجود رضوانك واثقةً، وإلى أعلى درجاتك سابقةً.\n" +
                "\n" +
                "اللَّهُمَّ اجعل عن يمينها نوراً حتّى تبعثها آمنةً مطمئنّةً في نورٍ من نورك.\n" +
                "\n" +
                "اللَّهُمَّ انظر إليها نظرة رضا، فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً.\n" +
                "\n" +
                "اللَّهُمَّ أسكنها فسيح الجنان، واغفر لها يا رحمن، وارحمها يا رحيم، وتجاوز عمّا تعلم يا عليم.\n" +
                "\n" +
                "اللَّهُمَّ اعف عنها فإنّك القائل “ويعفو عن كثير”.\n" +
                "\n" +
                "اللَّهُمَّ إنّها جاءت ببابك، وأناخت بجنابك، فَجد عليها بعفوك وإكرامك وجود إحسانك.\n" +
                "\n" +
                "اللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمها رحمةً تطمئنّ بها نفسها، وتقرّ بها عينها.\n" +
                "\n" +
                "اللَّهُمَّ احشرها مع المتّقين إلى الرّحمن وفداً.\n" +
                "\n" +
                "اللَّهُمَّ احشرها مع أصحاب اليمين، واجعل تحيّتها سلامٌ لك من أصحاب اليمين.\n" +
                "\n" +
                "اللَّهُمَّ بشّرها بقولك “كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية”\n" +
                "\n" +
                "اللَّهُمَّ اجعلها من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض.\n" +
                "\n" +
                "اللَّهُمَّ لا نزكّيها عليك، ولكنّا نحسبها أنّها أمنت وعملت صالحاً، فاجعل لها جنّتين ذواتي أفنان بحقّ قولك: “ولمن خاف مقام ربّه جنّتان”.\n" +
                "\n" +
                "اللَّهُمَّ شفع فيها نبيّنا ومصطفاك، واحشرها تحت لوائه، واسقها من يده الشّريفة شربةً هنيئةً لا تظمأ بعدها أبداً.\n" +
                "\n" +
                "اللَّهُمَّ اجعلها في جنّة الخلد \"الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا. لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا\".\n" +
                "\n" +
                "اللَّهُمَّ إنّها صبرت على البلاء فلم تجزع، فامنحها درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل \"إنّما يوفي الصّابرون أجرهم بغير حساب\".\n" +
                "\n" +
                "اللَّهُمَّ إنّها كانت تصلّى لك، فثبّتها على الصّراط يوم تزل الأقدام.\n" +
                "\n" +
                "اللَّهُمَّ إنّها كانت صائمةً لك، فأدخلها الجنّة من باب الريّان.\n" +
                "\n" +
                "اللَّهُمَّ إنّها كانت لكتابك تاليةً وسامعةً، فشفّع فيها القرآن، وارحمها من النّيران، واجعلها يا رحمن ترتقي في الجنّة إلى آخر آية قرأتها أو سمعتها، وآخر حرفٍ تلته.\n" +
                "\n" +
                "اللَّهُمَّ ارزقها بكلّ حرفٍ في القرآن حلاوة، وبكلّ كلمة كرامة، وبكلّ اّية سعادة، وبكلّ سورة سلامة، وبكل جْزءٍ جزاء.\n" +
                "\n" +
                "اللَّهُمَّ ارحمها فإنّها كان مسلمةً، واغفر لها فإنّها كان مؤمنةً، وأدخلها الجنّة فإنّها كانت بنبيّك مصدّقةً، وسامحها فإنّها كانت لكتابك مرتّلةً.\n" +
                "\n" +
                "اللَّهُمَّ اغفر لحيّنا وميّتنا، وشاهدنا وغائبنا، وصغيرنا وكبيرنا، وذَكرنَا وأنثانا.\n" +
                "\n" +
                "اللَّهُمَّ من أحييته منّا فأحيه على الإسلام، ومن توفّيته منّا فتوفّه على الإيمان.\n" +
                "\n" +
                "اللَّهُمَّ لا تحرمنا أجرها ولا تضللنا بعدها.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا أتانا اليقين، وعرق منّا الجبين، وكثر الأنين والحنين.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا يئس منّا الطبيب، وبكى علينا الحبيب، وتخلّى عنّا القريب والغريب، وارتفع النّشيج والنّحيب.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا اشتدّت الكربات، وتوالت الحسرات، وأطبقت الرّوعات، وفاضت العبرات، وتكشّفت العورات، وتعطّلت القوى والقدرات.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ، وبلغتِ التراقِ، وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ، إليك يا ربَّنا يومئذٍ المساق.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا ورينا التّراب، وغلقت القبور والأبواب، وانفضّ الأهل والأحباب، فإذا الوحشة والوحدة وهول الحساب.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا فارقنا النّعيم، وانقطع النّسيم، وقيل ما غرّك بربّك الكريم.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا أقمنا للسؤال، وخاننا المقال، ولم ينفع جاهٌ ولامال ولا عيال، وقد حال الحال، وليس إلّا فضل الكبير المتعال.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا نَسي اسمنا، ودَرس رسمنا، وأحاط بنا قسمنا ووسعنا.\n" +
                "\n" +
                "اللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر، ولم يذكرنا ذاكر، وما لنا من قوّة ولا ناصر، فلا أمل إلّا في القاهر القادر الغافر، يا من إذا وعد أوفى، وإذا توعّد عفا، وشفّع يا ربّ فينا حبيبنا المصطفى، واجعلنا ممّن صفا ووفا، وبالله اكتفى، يا أرحم الرّاحمين، يا حيّ يا قيّوم، يا بديع السموات والأرض، يا ذا الجلال والإكرام.\n" +
                "\n" +
                "اللَّهُمَّ إنّها امتك بنت أمتك ماتت وهى تشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر لها إنّك أنت الغفّار.\n" +
                "\n" +
                "اللَّهُمَّ لا تحرمنا أجرها، ولا تفتنّا بعدها، واغفر لنا ولها، واجمعنا معها في جنّات النّعيم يا ربّ العالمين.\n" +
                "\n" +
                "اللَّهُمَّ أنزل على أهلها الصّبر والسلوان وارضهم بقضائك.\n" +
                "\n" +
                "اللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد.\n" +
                "\n" +
                "اللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى اّله وصحبه وسلّم إلى يوم الدّين.", ""));
        ad3ia_3.add(new Model("أدعية للميّت الطفل الصغير (ذكر أو أنثى)\n" +
                "\n" +
                "اللَّهُمَّ اجْعَلْهُ فَرَطَاً وَذُخْراً لِوَالِدَيْهِ، وشَفِيعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وأعْظِمْ بهِ أُجُورَهُمَا، وألْحِقْهُ بِصَالِحِ الـمُؤْمِنينَ، واجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الجَحِيمِ، وأبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لأسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنا بالإيْمَانِ.", ""));
        ad3ia_3.add(new Model("الدّعاء للميّت في صّلاة الجنازة\n" +
                "\n" +
                "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ ، وَأَكْرِمْ نُزُلَهُ ، وَوَسِّعْ مُدْخَلَهُ ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ ، وَنَقِّهِ مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ ، وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ ، وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ ، وَأَدْخِلْهُ الْجَنَّةَ ، وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِ.", ""));


        return ad3ia_3;
    }

    public ArrayList<Model> ad3ia_4() {
        ArrayList<Model> ad3ia_4 = new ArrayList<>();
        ad3ia_4.add(new Model("اللَّهُمَّ ارْحَمْنِي بالقُرْءَانِ وَاجْعَلهُ لِي إِمَاماً وَنُوراً وَهُدًى وَرَحْمَةً *\n" +
                "\n" +
                "اللَّهُمَّ ذَكِّرْنِي مِنْهُ مَانَسِيتُ وَعَلِّمْنِي مِنْهُ مَاجَهِلْتُ وَارْزُقْنِي تِلاَوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَارَبَّ العَالَمِينَ *\n" +
                "\n" +
                "اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ *\n" +
                "\n" +
                "اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ وَخَيْرَ عَمَلِي خَوَاتِمَهُ وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ فِيهِ *\n" +
                "\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً هَنِيَّةً وَمِيتَةً سَوِيَّةً وَمَرَدًّا غَيْرَ مُخْزٍ وَلاَ فَاضِحٍ *\n" +
                "\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلةِ وَخَيْرَ الدُّعَاءِ وَخَيْرَ النَّجَاحِ وَخَيْرَ العِلْمِ وَخَيْرَ العَمَلِ وَخَيْرَ الثَّوَابِ وَخَيْرَ الحَيَاةِ وَخيْرَ المَمَاتِ وَثَبِّتْنِي وَثَقِّلْ مَوَازِينِي وَحَقِّقْ إِيمَانِي وَارْفَعْ دَرَجَتِي وَتَقَبَّلْ صَلاَتِي وَاغْفِرْ خَطِيئَاتِي وَأَسْأَلُكَ العُلَا مِنَ الجَنَّةِ *\n" +
                "\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمِ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالفَوْزَ بِالجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ *\n" +
                "\n" +
                "اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا، وَأجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ *\n" +
                "\n" +
                "اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَاتَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعْصِيَتِكَ وَمِنْ طَاعَتِكَ مَاتُبَلِّغُنَا بِهَا جَنَّتَكَ وَمِنَ اليَقِينِ مَاتُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَاأَحْيَيْتَنَا وَاجْعَلْهُ الوَارِثَ مِنَّا وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلاَ تجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا *\n" +
                "\n" +
                "اللَّهُمَّ لَا تَدَعْ لَنَا ذَنْبًا إِلَّا غَفَرْتَهُ وَلَا هَمَّا إِلَّا فَرَّجْتَهُ وَلَا دَيْنًا إِلَّا قَضَيْتَهُ وَلَا حَاجَةً مِنْ حَوَائِجِ الدُّنْيَا وَالآخِرَةِ إِلَّا قَضَيْتَهَا يَاأَرْحَمَ الرَّاحِمِينَ *\n" +
                "\n" +
                "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ وَصَلَّى اللهُ عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ وَأَصْحَابِهِ الأَخْيَارِ وَسَلَّمَ تَسْلِيمًا كَثِيراً.", ""));


        return ad3ia_4;
    }

    public ArrayList<Model> ad3ia_5() {
        ArrayList<Model> ad3ia_5 = new ArrayList<>();
        ad3ia_5.add(new Model("اللَّهُمَّ يَا بَارِئَ البَرِيَّاتِ ، وَغَافِرَ الخَـطِيَّاتِ ، وَعَالِمَ الخَفِيَّاتِ ، المُطَّلِعُ عَلَى الضَّمَائِرِ وَالنِّيَّاتِ ، يَا مَنْ أَحَاطَ بِكُلِّ شَيءٍ عِلْماً ، وَوَسِعَ كُلّ شَيْءٍ رَحْمَةً ، وَقَهَرَ كُلّ مَخْلُوقٍ عِزَّةً وَحُكْماً ، اغْفِرْ لِي ذُنُوبِي ، وَاسْتُرْ عُيُوبِيَ ، وَتَجَاوَزْ عَنْ سَيِّئَاتِيَ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.\n" +
                "\n" +
                "اللَّهُمَّ يَا سَمِيعَ الدَّعَوَاتِ ، يَا مُقِيلَ العَثَرَاتِ ، يَاقَاضِيَ الحَاجَاتِ ، يَا كَاشِفَ الكَرُبَاتِ ، يَا رَفِيعَ الدَّرَجَاتِ ، وَيَا غَافِرَ الزَّلاَّتِ ، اغْفِرْ لِلْمُسْلِمِينَ وَالمُسْلِمَاتِ ، وَالمُؤْمِنِينَ وَالمُؤْمِنَاتِ، الأحْيَاءِ مِنْهُم وَالأمْوَاتِ ، إِنَّكَ سَمِيعٌ قَرِيبٌ مُجِيبُ الدَّعَوَاتِ.\n" +
                "\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ ، وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ ، أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ ، الأَحَدُ الصَّمَدُ ، الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.\n" +
                "\n" +
                "اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ العّفْوَ فَاعْفُ عَنِّي.\n" +
                "\n" +
                "اللَّهُمَّ رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ، وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي ، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي.\n" +
                "\n" +
                "اللَّهُمَّ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي.\n" +
                "\n" +
                "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ.\n" +
                "\n" +
                "اللَّهُمَّ اغْفِرْ لِي ، وَارْحَمْنِي وَاهْدِنِي ، وَعَافِنِي وَارْزُقْنِي ، وَاجْبُرْنِي ، وَارْفَعْنِي.\n" +
                "\n" +
                "اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ ، وَلا تُنْقِصُهُ المَغْفِرَةُ ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ.\n" +
                "\n" +
                "اللَّهُمَّ إِنَّ ذُنُوبِي عِظَامٌ وَهِي صِغَارٌ فِي جَنْبِ عَفْوِكَ يَا كَرِيمُ ، فَاغْفِرْهَا لِي.\n" +
                "\n" +
                "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَوَسِّعْ لِي فِي دَارِي ، وَبَارِكْ لِي فِي رِزْقِي.\n" +
                "\n" +
                "اللَّهُمَّ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ، رَبَّنَا وَلا تَحْمِلْ عَلَينَا إِصْرَاً كَمَا حَمَلْتَهَ عَلَى الَّذِينَ مِنْ قَبْلِنَا ، رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ ، وَاعْفُ عَنَّا وّاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانْصُرْنَا عَلَى القَوْمِ الكَافِرِينَ.\n" +
                "\n" +
                "اللَّهُمَّ إِنَّا قَدْ أَطَعْنَاكَ فِي أَحَبِّ الأشْيَاءِ إِلَيْكَ أَنْ تُطَاعَ فِيْهِ ، الإيمَانِ بِكَ ، وَالإِقْرَارِ بِكَ ، وَلَمْ نَعْصِكَ فِي أَبْغَضِ الأَشْيَاءِ أَنْ تُعْصَى فِيْهِ ؛ الكُفْرِ وَالجَحْدِ بِكَ ، اللَّهُمَّ فَاغْفِرْ لَنَا مَا بَيْنَهُمَا.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ ، وَمَا أَعْلَنْتُ وَمَا أَسْرَرْتُ ، وما أنت أعلم به مني ، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ لا إِلَهَ إِلاَّ أَنْـتَ.\n" +
                "\n" +
                "اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأَبْرَارِ.\n" +
                "\n" +
                "اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا وَلإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيْمَانِ ، رَبَّنَا وَسِعْتَ كُلّ شَيءٍ رَحْمَةً وَعِلْماً فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَاب الجَحِيمِ.\n" +
                "\n" +
                "اللَّهُمَّ أَقِلْ عَثَرَاتِنَا ، وَاغْفِرْ زَلاَّتِنَا ، وَكَفِّرْ عَنَّا سَيِّئَاتِنَا ، وَتَوَفَّنَا مَعَ الأَبْرَارِ.\n" +
                "\n" +
                "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالمَاءِ وَالثَّلْجِ وَالبَرَدِ ، اللَّهُمَّ نَقِّنِي مِنْ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِـنَ الدَّنَسِ.\n" +
                "\n", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظلْماً كَثِيراً ، وَلا يَغْفِرُ الذُّنُوب إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدَكَ ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الوَاحِدُ الأَحَدُ ، الصَّمَدُ ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ، أَنْ تَغْفِرَ لِي ذُنُـوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ.\n" +
                "اللَّهُمَّ إِلَهِي : حُجَّتِي حَاجَتِي ، وَعُدَّتِي فَاقَتِي ، فَارْحَمْنِي.\n" +
                "اللَّهُمَّ إِلَهِي : كَيْفَ أمْتَنِعُ بِالذَّنْبِ مِنَ الدُّعَاءِ ، وَلا أَرَاكَ تَمْنَعُ مَعَ الذَّنْبِ مِنَ العَطَاءِ ، فَإِنْ غَفَرْتَ فَخَيرُ رَاحِمٍ أَنْتَ ، وَإِنْ عَذَّبْتَ فَغَيْرُ ظَالِمٍ أَنْتَ.\n" +
                "اللَّهُمَّ إِلَهِي: أَسْأَلُكَ تَذَلُّلاً فَأَعْطِنِي تَفَضُّلاً.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ يَامَنْ عَلَى العَرْشِ اسْتَوَى ، يَامَنْ خَلَقَ فَسَوَّى وَقدَّرَ فَهَدَى ، وَأَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى ، يَامَنْ أَضْحَكَ وَأَبْكَى، وَأَمَاتَ وَأَحْيَا ، وَأَسْعَدَ وَأَشْقَى ، وَأَوْجَدَ وَأَبْلَى ، وَرَفَعَ وَخَفَضَ ، وَأَعَزَّ وَأَذَلَّ، وَأَعْطَى وَمَنَعَ ، وَرَفَعَ وَوَضَعَ.\n" +
                "اللَّهُمَّ يَا مَنْ شَقَّ البِحَارَ ، وَأَجْرَى الأَنْهَارَ ، وَكَوَّرَ النَّهَارَ عَلَى اللَّيلِ وَاللَّيلَ عَلَى النَّهَارِ ، يَا مَنْ هَدَى مِنْ ضَلالَةٍ ، وَأَنْقَذَ مِنْ جَهَالَةٍ ، وَأَنَارَ الأَبْصَارَ ، وَأَحْيَا الضَّمَائِرَ وَالأَفْكَارَ.\n" +
                "اللَّهُمَّ اهْدِنَا فِيمَنْ هَدَيْتَ ، وَعَافِنَا فِيمَنْ عَافَيتَ ، وَتَوَلَّنَا فِيمَنْ تَوَلَّيْتَ.\n" +
                "اللَّهُمَّ اهْدِنَا الصِّرَاطَ المُسْتَقِيمَ ، صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيهِم مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ.\n" +
                "اللَّهُمَّ وَفِّقْنَا لِهُدَاكَ وَاجْعَلْ عَمَلَنَا فِي رِضَاكَ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ.\n" +
                "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا.\n" +
                "اللَّهُمَّ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلّ شَيءٍ قَدِيرٌ.\n" +
                "اللَّهُمَّ حَبِّبْ إلَينَا الإيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا ، وَكَرِّهِ إلَينَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانِ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ.\n" +
                "اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ.\n", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ خُذْ بِنَوَاصِينَا لِِلْبِرِّ وَالتَّقْوَى ، وَلِمَا تُحِبُّ مِنَ العَمَلِ وَتَرْضَى.\n" +
                "اللَّهُمَّ رَبِّ جِبْرَائِيلَ وَمِيكَائِيلَ ، وَإسْرَافِيلَ ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضَ ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيْهِ يَخْتَلِفُونَ ، اهْدِنَا لِمَا اخْتُلِفَ فِيْهِ مِنَ الحَقِّ بِإذْنِكَ ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ.\n" +
                "اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَكَ ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حَزَنِي ، وَذَهَابَ هَمِّي.\n" +
                "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً ، وَفِي سَمْعِي نُوراً ، وَفِي بَصَرِي نُوراً ، وَعَنْ يَمِينِي نُوراً ، وَعَنْ شِمَالِي نُوراً ، وَمِنْ بَيْنَ يَدَيَّ نُوراً ، وَمِنْ خَلْفِي نُوراً ، وَمِنْ فَوقِي نُوراً ، وَمِنْ تَحْتِي نُوراً ، وَاجْعَلْ لِي نُوراً ، وَأَعْظِمْ لِي نُوراً.\n" +
                "اللَّهُمَّ أَغْنِنِي بِالعِلْمِ ، وَزَيِّنِّي بِالحِلْمِ ، وَأَكْرِمْنِي بِالتَّقْوَى ، وَجَمِّلْنِي بِالعَافِيَةِ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمَ الخَائِفِينَ مِنْكَ ، وَخَوفَ العَالِمِينَ بِكَ ، وَيَقِينَ المُتَوَكِّلِينَ عَلَـيْكَ ، وَتَوَكُّلَ المُوقِنِينَ بِكَ ، وَإِنَابَةَ المُخْبِتِينَ إِلَيْكَ ، وَإِخْبَاتَ المُنِيبينَ إِلَيْكَ ، وَشُكْرَ الصَّابِرِينَ لَكَ ، وَصَبْرَ الشَّاكِـرِينَ لَكَ ، وَلَحَاقاً بِالأَحْيَاءِ المَرْزُوقِينَ عِنْدَكَ.\n" +
                "اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى وَالسَّدَادَ.\n" +
                "اللَّهُمَّ أَلْهِمْنِي رُشْدِي ، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي.\n" +
                "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي ، وَعَلِّمْنِي مَا يَنْفَعُنِي ، وَزِدْنِي عِلْماً.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً ، وَأَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ ثَبِّتْنِي وَاجْعَلْنِي هَادِياً مَهْدِيّاً.\n" +
                "اللَّهُمَّ لَكَ أَسْلَمْتُ ، وَبِكَ آمَنْتُ ، وَعَلَيكَ تَوَكَّلْتُ ، وَإِلَيكَ أَنَبْتُ ، وَبِكَ خَاصَمْتُ، أَعُوذُ بِعِزَّتِكَ ، لا إِلَهَ إِلاَّ أَنْتَ ، أَنْ تُضِلَّنِي ، أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ.\n" +
                "اللَّهُمَّ اهْدِنِي لأَحْسَنِ الأَخْلاَقِ لا يَهْدِي لأَحْسَنِهَا إِلاَّ أَنْتَ ، وَاصْرِفْ عَنِّي سَيِّئَها لا يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ.\n" +
                "اللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي.\n" +
                "اللَّهُمَّ فَالِقَ الحَبِّ وَالنَّوَى ، وَمُخْرِجَ الحَيِّ مِنَ المَيِّتِ وَمُخْرِجَ المَيِّتِ مِنَ الحَيِّ ، فَالِقَ الإِصْبَاحِ ، وَجَاعِلَ اللَّيلِ سَكَناً ، وَالشَّمْسَ والقَمَرَ حُسْبَاناً ، يَا مَنْ جَعَلَ لَنَا النُّجُومَ لِنَهْتَدِيَ بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالبَحْرِ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ جَلَّتْ قُدْرَتُكَ ، وَتَعَالَتْ حِكْمَتُكَ ، وَتَبَارَكَ اسْمُكَ ، وَتَعَالَى جَدُّكَ ، وَلا إِلَهَ غَيْرُكَ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الحَمْدَ ، لا إِلَهَ إِلاَّ أَنْتَ ، المَنَّانُ ، بَدِيعُ السَّمَاوَات وَالأَرْضِ، ذُو الجَلالِ وَالإِكْرَامِ ، يَا حَيُّ يَا قَيُّومُ.\n" +
                "اللَّهُمَّ ارْزُقْنَا رِزْقًا يَزِيدُنَا لَكَ شُكْراً ، وَإِلَيكَ فَاقَةً وَفَقْراً ، وَبِكَ عَمَّنْ سِوَاكَ غِنىً.\n" +
                "اللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي ، وَانْقِطَاعِ عُمُرِي.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ فَإِنَّهُ لا يَمْلِكُهَا إِلاَّ أَنْتَ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ رَبِّ لا تَذَرْنِي فَرْداً وَأَنْتَ خَيْرُ الْوَارِثِينَ.\n" +
                "اللَّهُمَّ رَبِّ هَبْ لِيْ مِنَ الصَّالِحِينَ.\n" +
                "اللَّهُمَّ قَنِّعْنِي بِمَا رَزَقْتَنِي ، وَبَارِكْ لِي فِيْهِ ، وَاخْلُفْ عَلَيَّ كُلّ غَائِبَةٍ لِي مِنْكَ بِخَيرٍ.\n" +
                "اللَّهُمَّ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّة أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَاماً.\n" +
                "اللَّهُمَّ يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ بِنُجُومِهَا وَأَبْرَاجِهَا ، وَالأَرْضُ بِسُهُولِـــهَا وَفِجَاجِهَا ، وَالبِحَارُ بِأَحْيَائِهَا وَأَمْوَاجِهَا ، وَالجِبَالُ بِقِمَمِهَا وَأَوْتَادِهَا ، وَالأَشْجَارُ بِفُرُوعِهَا وَثِمَارِهَا ، وَالسِّبَاعُ فِي فَلَوَاتِهَا ، وَالطَّيْرُ فِي وَكَنَاتِهَا ، يَا مَنْ تُسَبِّحُ لَهُ الذَّرَّاتُ عَلَى صِغََرِهَا ، وَالمَجَرَّاتُ عَلَى كِبَرِهَـا ، يَا مَنْ تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالأَرْضُ وَمَنْ فِيهِنَّ ، وِإنْ مِنْ شَيءٍ إِلاَّ يُسَبِّحُ بِحَمْدِه.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ يَا مَنْ خَلَقَ الأَرْضَ وَالسَّمَاوَاتِ العُلَى ، يَا رَحْمَاناً عَلَى العَرْشِ اسْتَوَى ، يَا مَنْ لَهُ مَا فِي السَّمَاوَات وَمَا فِي الأَرْضِ وَمَا بَيْنَهُمَا ، وَمَا تَحْتَ الثَّرَى ، يَا مَنْ يَعْلَمُ السِّرَ وَأَخْفَى، يَا مَنْ لَهُ الأَسْمَاءُ الحُسْنَى ، يَا مَنْ مَعَ عِبَادِهِ يَسْمَعُ وَيَرَى ، يَا مَنْ أَعْطَى كُلّ شَيءٍ خَلْقَهُ ثُمَّ هَدَى.\n" +
                "اللَّهُمَّ أَنْتَ البَادِئُ بِالإِحْسَانِ مِنْ قَبْلِ تَوَجُّهِ العَابِدِينَ ، وَأَنْتَ البَادِئُ بِالعَطَايَا قَبْلَ طَلَبِ الطَّالِبِينَ وَأَنْتَ الوَهَّابُ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ ، وَأَعُوذُ بِكَ مَنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ.\n" +
                "اللَّهُمَّ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً فِي الجَنَّةِ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ.\n", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ أَحْسِنْ عَاقِبَتِنَا فِي الأُمُورِ كُلِّهَا ، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ.\n" +
                "اللَّهُمَّ رَبَّنَا اصْرِفْ عَنَّا عَذَاب جَهَنَّم إِنَّ عَذَابَهَا كَانَ غَرَاماً.\n" +
                "اللَّهُمَّ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَاب النَّارِ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ ، وَأسْتَجِيرُ بِكَ مِنَ النَّارِ.\n" +
                "اللَّهُمَّ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسِلِكَ وَلا تُخْزِنَا يَومَ القِيامَة إِنَّكَ لا تُخْلِفُ المِيعَادِ.\n", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ حَاسِبْنِي حِسَاباً يَسِيراً.\n" +
                "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نُشْرِكَ بِكَ شَيْئاً نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لا نَعْلَمُهُ.\n" +
                "اللَّهُمَّ إنِّيْ أعُوذُ بِكَ مِنْ جَهْدِ البَلاء ، ودَرَكِ الشّــَقَاء ، وســوء القضاء ، وشَمَاتَة الأعْدَاء ، يَا سَمِيْع الدُّعَاء.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ ، وَمِنْ عَذَابِ القَبْرِ ، وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَـاتِ ، وَمِنْ فِتْنَةِ المَسِيحِ الدَّجَّالِ ، وَأَعُوذُ بِكَ مِنَ المَأْثَمِ وَالمَغْرَمِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ ، وَفِتْنَةِ القَبْرِ ، وَعَذَابِ القَبْرِ ، وَشَرِّ فِتْنَةِ الغِنَى ، وَشَرِّ فِتْنَةِ الفَقْرِ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ اغْسِلْ قَلْبِي بِمَاءِ الثَّلْجِ وَالْبَرَدِ ، وَنَقِّ قَلْبِيَ مِنْ الخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ ، وَبَاعِدْ بَيْنِي وَبيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالمَأْثَمِ وَالمَغْرَمِ.\n" +
                "اللَّهُمَّ رَبِّ جِبْرَائِيلَ ، وَمِيكَائِيلَ ، وَرَبِّ إِسْرَافِيلَ ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ القَبْرِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَارِ السُّوءِ فِي دَارِ المُقَامَةِ ، فَإِنَّ جَارَ البَادِيَةِ يَتَحَوَّلُ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ ، وَالجُبْنِ وَالبُخْلِ ، وَالهَرَمِ وَالقَسْوَةِ ، وَالغَفْلَةِ وَالعَيْلَةِ وَالذِّلَّةِ ، وَالمَسْكَنَةِ ، وَأَعُوذُ بِكَ مِنَ الفَقْرِ وَالكُفْرِ ، وَالفُسُوقِ وَالشِّقَاقِ وَالنِّفَاقِ، وَالسُّمْعَةِ وَالرِّيَاءِ ، وَأَعُوذُ بِكَ مِنَ الصَّمَمِ وَالبَكَمِ ، وَالجُنُونِ ، وَالجِذَامِ ، وَالبَرَصِ ، وَسَيِّئِ الأَسْقَامِ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ ، وَالجُبْنِ ، وَالبُخْلِ ، وَالهَرَمِ ، وَعَذَابِ القَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا ، أَنْتَ وَلِيُّهَا وَمَوْلاَهَا.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ ، وَمِنْ قَلْبٍ لا يَخْشَعُ ، وَمِنْ نَفْسٍ لا تَشْبَعُ ، وَمِنْ دَعْوَةٍ لا يُسْتَجَابُ لَهَا.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاَقِ وَالأَعْمَالِ وَالأَهْوَاءِ وَالأَدْوَاءِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ تُحَسِّنَ فِي لَوَائِحِ العُيُونِ عَلانِيَتِي ، وَتُقَبِّحَ فِي خَفِيَّاتِ العُيُونِ سَرِيرَتِي ، اللَّهُمَّ كَمَا أَسَأْتُ وَأَحْسَنْتَ إِلَيَّ ، فَإِذَا عُدْتُ فُعُدْ عَلَيَّ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْـعِي ، وَمِنْ شَرِّ بَصَــرِي ، وَمِنْ شَــرِّ لِسَـانِيْ ، وَمِنْ شَرِّ قَـلْـبِي ، ومن شـرِّ مَنِيِّي.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَقُولَ زُوراً ، أَوْ أَغْشَى فُجُوراً ، أَوْ أَكُونَ بِكَ مَغْرُوراً.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشِّقَاقِ وَالنِّفَاقِ ، وَسُوءِ الأخْلاقِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ ، وَبِكَ مِنْكَ ، لا أُحْصِى ثَنَاءً عَلَيْكَ ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ.\n" +
                "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ ، وَرَبَّ العَرْشِ العَظِيمِ ، رَبَّنَا وَرَبَّ كُلّ شَيءٍ ، فَالِقَ الحَبِّ وَالنَّوَى ، وَمُنَزِّلَ التَّوْرَاةَ وَالإنْجِيلَ وَالفُرْقَانَ ، أَعُوذُ بِكَ مِنْ شَرِّ كُلّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيسَ قَبْلَكَ شَيءٌ ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيءٌ ، وَأَنْتَ الظَّاهِرُ فَلَيسَ فَوْقَكَ شَيءٌ ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الفَقْرِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ ، وَغَلَبَةِ العَدُوِّ ، وَشَمَاتَةِ الأَعْدَاءِ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الفَقْرِ وَالقِلَّةِ وَالذِّلَّةِ ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ الغِنَى ، وَمِنْ شَرِّ فِتْنَةِ الفَقْرِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ ، وَتَحَوُّلِ عَافِيَتِكَ ، وَفُجَاءَةِ نِقْمَتِكَ ، وَجَمِيعِ سَخَطِكَ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ يَوْمِ السُّوءِ ، وَمِنْ لَيْلَةِ السُّوءِ ، وَمِنْ سَاعَةِ السُّوءِ ، وَمِنْ صَاحِبِ السُّوءِ ، وَمِنْ جَارِ السُّوءِ ، فِي دَارِ المُقَامَةِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لا يَخْشَعُ ، وَمِنْ دُعَاءٍ لا يُسْمَعُ ، وَمِنْ نَفْسٍ لا تَشْبَعُ ، وَمِنْ عِلْمٍ لا يَنْفَعُ ، أَعُوذُ بِكَ مِنْ هَؤُلاَءِ الأَرْبَعِ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ التَّـرَدِّي ، وَالهَدْمِ ، وَالغَرَقِ ، وَالحَرْقِ وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيطَانُ عِنْدَ المَوْتِ ، وَأَعُوذُ بِكَ مِنْ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِراً ، وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغاً.\n" +
                "اللَّهُمَّ رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ ، وَأَعُوذُ بِكَ ربِّ أَنْ يَحْضُرُونَ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ الأَشْرَارِ ، وَمِنْ كَيْدِ الفُجَّارِ ، ومِنْ طَوَارِقِ اللَّيْلِ والنَّهَارِ إلاَّ طَارِقَاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنْ.\n" +
                "اللَّهُمَّ رَبِّ أَعُوذُ بِكَ مِنْ أَعْيُنِ العَائِنِينَ ، وَمِنْ سِحْرِ السَّاحِرِينَ ، وَمِنْ شَرِّ كُلِّ ذِي شَرِّ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الجُوعِ ، فَإِنَّهُ بِئْسَ الضَّجِيعُ ، وَأَعُوذُ بِكَ مِنْ الخِيَانَةِ ، فَإنَّهَا بِئْسَتِ البِطَانَةُ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عُقُوقِ الأَبْنَاءِ ، وَمِنْ قَطِيعَةِ الأَقْرِبَاءِ ، وَمِنْ جَفْوَةِ الأَحْيَاءِ ، وَمِنْ تَغَيُّرِ الأَصْدِقَاءِ ، وَمِنْ شَمَاتَةِ الأَعْدَاءِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أنْ أَزِلَّ أَوْ أُزَلَّ ، أَوْ أَضِلَّ أَوْ أُضَلَّ ، أَوْ أَظْلِمَ أَوْ أُظْلَمَ ، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ.\n" +
                "اللَّهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَهْدِيكَ، وَنَسْتَغْفِرُكَ وَنَتُوبُ إِلَيْكَ وَنُؤمِنُ بِكَ ، وَنَتَوَكَّلُ عَلَيْكَ ، وَنُثْنِي عَلَيْكَ الخَيْرَ كُلّهُ ، نَشْكُرُكَ وَلا نَكْفُرُكَ ، وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ ، اللَّهُمَّ إِيَّاكَ نَعْبُدُ ، وَلَكَ نُصَلِّي وَنَسْجُدُ ، وَإِلَيكَ نَسْعَى وَنَحْفِدُ ، نَرْجُو رَحْمَتَكَ ، وَنَخْشَى عَذَابَكَ ، إِنَّ عَذَابَكَ الجِدَّ بِالكُفَّارِ مُلْحِقٌ.\n" +
                "اللَّهُمَّ رَبَّنَا أَعِزَّنَا بِالإِسْلامِ ، وَأَعِزَّ بِنَا الإسْلامَ ، اللَّهُمَّ أَعْلِ بِنَا كَلِمَةَ الإسْلاَمِ ، وَارْفَعْ بِنَا رَايَةَ القُرْآنِ.\n" +
                "اللَّهُمَّ مُنْزِلَ الكِتَابِ ، وَمُجْرِيَ السَّحَابِ وَهَازِمَ الأَحْزَابِ ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ وَإِذَا سُئِلْتَ بِهِ أَعْطَيْتَ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ يَاحَيُّ يَا قَيُّومُ ، يَاحَيُّ يَاقَيُّومُ ، يَاحَيُّ يَا قَيُّومُ ، اللَّهُمَّ أَظِلَّنِي فِيْ ظِلِّ عَرْشِكَ يَوْمَ لا ظِلَّ إِلاَّ ظِلُّكَ.\n" +
                "اللَّهُمَّ أَظْهِرْ دِينَكَ عَلَى الدِّينِ كُلِّهُ وَلَوْ كَرِهَ المُشْرِكُونَ.\n" +
                "اللَّهُمَّ يَا مَنْ يُجِيبُ المُضْطَرَّ إِذَا دَعَاهُ ، وَيَكْشِفُ السُّوءَ ، اكْشِفِ السُّوءَ عَنْ إِخْوَانِنَا الأُسَارَى وَالمَسْجُونِينَ وَالمُعْتَقَلِينَ ، اللَّهُمَّ افْكُكْ بِقُوَّتِكَ أَسْرَهُمْ ، وَاجْبُرْ بِرَحْمَتِكَ كَسْرَهُمْ ، وَتَوَلَّ بِعِنَايَتِكَ أَمْرَهُمْ ، وَرُدَّهُمْ إِلَى أَهْلِيهِمْ سَالِمِينَ غَانِمِينَ.\n" +
                "اللَّهُمَّ كُنْ لِلْمُسْلِمينَ وَالمُسْتَضْعَفِينَ فِي كُلَّ مَكَانٍ ؛ فَرِّجْ هَمَّهُم ، وَنَفِّسْ كَرْبَهُم ، وَأَقِلْ عَثْرَتَهُم وَتَوَلَّ بِنَفْسِكَ أَمْرَهُم.\n" +
                "اللَّهُمَّ ارْفَعْ رَايَتَهُم ، وَاكْبِتْ عَدُوَّهُمْ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ وَحِّدْ صَفَّهُم ، وَاجْمَعْ كَلِمَتَهُم ، وَرُدَّهُم إِلَيْكَ رَدَّاً جَمِيلاً.\n" +
                "اللَّهُمَّ لا أَبَرَّ بِهِم مِنْكَ ، وَلا أَرْحَمَ بِهِم مِنْكَ، وَلا أَرْأَفَ بِهِم مِنْكَ.. اللَّهُمَّ هُمْ مِنْكَ وَإِلَيكَ.. اللَّهُمَّ فَاجْعَلِ الدَّائِرَةَ لَهُم لا عَلَيهِم وَالنَّصْرَ حَلِيفَهُمْ.. يَا رَبِّ.\n" +
                "اللَّهُمَّ يَا خَيْرَ مَنْ سُئِلَ ، وَأَجْوَدَ مَنْ أَعْطَى ، وَأَكْرَمَ مَنْ عَفَا ، وَأَعْظَمَ مَنْ غَفَرَ ، وَأَعْدَلَ مَنْ حَكَمَ ، وَأَصْدَقَ مَنْ حَدَّثَ ، وَأَوْفَى مَنْ وَعَدَ ، وَأَبْصَرَ مَنْ رَاقَبَ ، وَأَسْرَعَ مَنْ حَاسَبَ ، وَأَرْحَمَ مَنْ عَاقَبَ ، وَأَحْسَنَ مَنْ خَلَقَ ، وَأَحْكَمَ مَنْ شَرَعَ ، وَأَحَقَّ مَنْ عُبِدَ ، وَأَوْلَى مَنْ دُعِيَ ، وَأَبَرَّ مَنْ أَجَابَ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلَةِ ، وَخَيرَ الدُّعَاءِ ، وَخَيرَ النَّجَاحِ ، وَخَيرَ العَمَلِ ، وَخَيرَ الثَّوَابِ ، وَخَيرَ الحَيَاةِ ، وَخَيرَ المَمَاتِ ، وَثَبِّتْنِي ، وَثَقِّلْ مَوَازِينِي ، وَحَقِّقْ إِيمَانِي ، وَارْفَعْ دَرَجَاتِي ، وَتَقَبَّلْ صَلاَتِي ، وَاغْفِرْ خَطِيئَتِي ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ فَوَاتِحَ الخَيرِ ، وَخَوَاتِـمَهُ ، وَجَوَامِعَهُ ، وَأَوَّلَهُ ، وَظَاهِرَهُ ، وَبَاطِنَهُ ، وَالدَّرَجَاتِ العُلَى مِنَ الجَنَّة آمِينَ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ مَا آتِي ، وَخَيْرَ مَا أَفْعَلُ ، وَخَيرَ مَا أَعْمَلُ ، وَخَيْرَ مَا بَطَنَ ، وَخَيْرَ مَا ظَهَرَ ، وَالدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَرْفَعَ ذِِكْرِي ، وَتَضَعَ وِزْرِيَ ، وَتُصْلِحَ أَمْرِيَ ، وَتُطَهِّرَ قَلـْبِيَ ، وَتُحَصِّنَ فَرْجِيَ ، وَتُنَوِّرَ قَلْبِيَ ، وَتَغْفِرَ لِي ذَنْبِيَ ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تُبَارِكَ فِي نَفْسِي ، وَفِي سَمْعِي ، وَفِي بَصَرِي ، وَفِي رُوحِي ، وَفِي خَلْقِي ، وَفِي خُلُقِي ، وَفِي أَهْلِي ، وَفِِي مَحْيَاي ، وَفِي مَمَاتِي ، وَفِي عَمَلِي ، فَتَقَبَّلْ حَسَنَاتِي ، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ آمِينَ.\n" +
                "اللَّهُمَّ لَكَ الحَمْدُ كُلُّهُ ، اللَّهُمَّ لا قَابِضَ لِمَا بَسَطْتَ ، وَلا بَاسِطَ لِمَا قَبَضْتَ ، وَلا هَادِيَ لِمَنْ أَضْلَلْتَ وَلا مُضِلَّ لِمَنْ هَدَيْتَ ، وَلا مُعْطِي لِمَا مَنَعْتَ وَلا مَانِعَ لِمَا أَعْطَيتَ ، وَلا مُقَرِّبَ رَبِّ لِمَا بَاعَدْتَ ، وَلا مُبَاعِدَ لِمَا قَرَّبْتَ ، اللَّهُمَّ ابْسُطْ عَلَينَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ المُقِيمَ الَّذِي لا يَحُولُ وَلا يَـزُولُ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ العَيْلَةِ وَالأَمْنِ يَوْمَ الخَوفِ ، اللَّهُمَّ إِنِّي عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَنَا.\n" +
                "اللَّهُمَّ حَبِّبْ إِلَينَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا وَكَرِّه إِلَيْنَا الكُفْرَ وَالفُسُوقَ وَالعِصْيانَ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ ، اللَّهُمَّ تَوَفَّنَا مُسْـلِمِينَ ، وَأَحْينَا مُسْلِمِينَ ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيرَ خَزَايَا وَلاَ مَفْتُونِينَ ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ ، وَيَصُدُّونَ عَنْ سَبِيلِكَ ، وَاجْعَلْ عَلَيهِم رِجْزَكَ وَعَذَابَكَ ، اللَّهُمَّ قَاتِلِ الكَفَرَةَ الَّذِينَ أُوتُوا الكِتَابَ ، إِلَهَ الحَقِّ.. آمِينَ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ بِعِلْمِكَ الغَيبِ ، وَقُدْرَتِكَ عَلَى الخَلْقِ ؛ أَحْيِنِي مَا عَلِمْتَ الحَيَاةَ خَيْراً لِي ، وَتَوَفَّنِي إِذَا عَلِمْتَ الوَفَاةَ خَيْراً لِي ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الغَيْبِ وَالشَّهَادَةِ ، وَأَسْأَلُكَ كَلِمَةَ الحَقِّ فِي الرِّضَا وَالغَضَبِ ، وَأَسْأَلُكَ القَصْدَ فِي الغِنَى وَالفَقْرِ ، وَأَسْأَلُكَ نَعِيماً لا يَنْفَدُ ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لا تَنْقَطُعُ ، وَأَسْأَلُكَ الرِّضَا بَعْدَ القَضَاءِ ، وَأَسْأَلُكَ بَرْدَ العَيْشِ بَعْدَ المَوْتِ ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ ، وَالشَّوْقَ إِلَى لِقَائِكَ ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةَ وَلا فِتْنَةً مُضِلَّةَ ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الخَيْرَاتِ ، وَتَرْكَ المُنْكَرَاتِ ، وَحُبَّ المَسَاكِينَ ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي ، وَإذَا أَرَدْتَ فِتْنَةَ قَومٍ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ ، وَأَسْأَلُكَ حُبَّكَ ، وَحُبَّ مَنْ يُحِبّـُكَ ، وَحُبَّ كل عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّـكَ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الخَيْرِ كُلِّهُ ؛ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ ، وَأَعُوذُ بِكَ مِنْ الشَّرِّ كُلِّهُ عَاجِلِهِ وَآجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ محمد ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ بِكَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ محمد.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْراً.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغْنَا بِهِ جَنَّتَكَ ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا ، اللَّهُمَّ مَتِّعْنَا بِأَسْمَاعِنَا ، وَأَبْصَارِنَا ، وَقُوَّاتِنَا مَا أَحْيَيْتَنَا ، وَاجْعَلْهُ الوَارِثَ مِنَّا ، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا ، وَانْصُرْنَا عَلَى مَنْ عَادَانَا ، وَلا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلا تَجْعَلْ الدُّنْيَا أَكْبَرَ هَمِّنَا ، وَلا مَبْلَغَ عِلْمِنَا ، وَلا تُسَلِّطْ عَلَيْنَا مَنْ لا يَرْحَمْنَا.\n" +
                "اللَّهُمَّ إِنَّا نَسْألُكَ مُوجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَالسَّلامَةَ مِنْ كُلِّ إثْمٍ ، وَالغَنِيمَةَ مِنْ كُلِّ بِرِّ ، وَالفَوْزَ بِالجَنَّةِ ، وَالنَّجَاةَ مِنَ النَّارِ.\n" +
                "اللَّهُمَّ لا تَدَعْ لَنَا ذَنْبًا إِلاَّ غَفَرْتَهُ ، وَلا هَمًّا إِلاَّ فَرَّجْتَهُ ، وَلا دَيْنًا إِلاَّ قَضَيْتَهُ ، وَلا مَرِيضاً إِلاَّ شَفَيْتَهُ ، وَلا مُبْتَلَى إِلاَّ عَافَيْتَهُ ، وَلا ضَالاً إِلاَّ هَدَيْتَهُ ، وَلا غَائِباً إِلاَّ رَدَدْتَهُ ، وَلا مَظْلُوماً إِلاَّ نَصَرْتَهُ ، وَلا أَسِيراً إِلاَّ فَكَكْتَهُ ، وَلا مَيِّتاً إِلاَّ رَحِمْتَهُ ، وَلا حَاجَةً لَنَا فِيهَا صَلاحٌ وَلَكَ فِيهَا رِضاً إِلاَّ قَضَيْتَهَا وَيَسَّرْتَهَا بِفَضْلِكَ يَا أَكْرَمَ الأَكْرَمِينَ.\n" +
                "اللَّهُمَّ رَبِّ أَعِنِّي وَلا تُعِنْ عَلَيَّ ، وَانْصُرْنِي وَلا تَنْصُرْ عَلَيَّ ، وَامْكُرْ لِي وَلا تَمْكُرْ عَلَيَّ ، وَاهْدِنِي وَيَسِّرِ الهُدَى إِلَيَّ ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ.\n" +
                "اللَّهُمَّ رَبِّ اجْعَلْنِي لَكَ شَكَّاراً ، لَكَ ذَكَّاراً ، لَكَ رَهَّاباً ، لَكَ مِطْـوَاعاً ، إِلَيْكَ مُخْبِتاً أَوَّاهاً مُنِيباً ، رَبِّ تَقَبَّلْ تَوْبَتِي ، وَاغْسِلْ حَوْبَتِي ، وَأَجِبْ دَعْوَتِي ، وَثَبِّتْ حُجَّتِي ، وَاهْدِ قَلْبِي ، وَسَدِّدْ لِسَانِي ، وَاسْلُلْ سَخِيمَةَ قَلْبِي.\n", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنَّا نَسْألكَ يُسْراً لَيْسَ بَعْدَهُ عُسْرٌ ، وَغِنىً لَيْسَ بَعْدَهُ فَقْرٌ ، وَأَمْناً لَيْسَ بَعْدَهُ خَوْفٌ ، وَسَعَادَةً لَيْسَ بَعْدَهَا شَقَاءٌ.\n" +
                "اللَّهُمَّ ألِّفْ بَيْنَ قُلُوبِنَا ، وَأَصْلِحْ ذَاتَ بَيْنِـنَا ، وَاهْدِنَا سُبُلَ السَّلامِ ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ ، وَجَنِّبْنَا الفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ، وَبَارِكْ لَنَا فِي أَسْمَاعِـنَا ، وَأَبْصَارِنَا ، وَقُلُوبِنَا ، وَأَزْوَاجِـنَا ، وَذُرِّيَّاتِنَا ، وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ ، وَاجْعَلْنَا شَاكِرِينَ لِنِعَمِكَ مُثْنِينَ بِهَا عَلَيْكَ قَابِلِينَ لَهَا وَأَتْمِمْهَا عَلَيْنَا.\n" +
                "اللَّهُمَّ يَا مُقَلِّبَ القُلُوبِ وَالأَبْصَارِ ، ثَبِّتْ قُلُوبَنَا عَلَى طَاعَتِكَ ، وَلا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا ، ولا تَفْتِنَّا فِي دِينِنَا ، وَاجْعَلْ يَوْمَنَا خَيْراً مِنْ أَمْسِنَا ، وَاجْعَلْ غَدَنَا خَيْراً مِنْ يَوْمـِنَا ، وَاجْعَلْ خَيْرَ أَعْمَارِنَا أَوَاخِرَهَا ، وَخَيْرَ أَعْمَالِنَا خَوَاتِيمَهَا ، وَخَيْرَ أَيَّامِنَا يَوْمَ نَلْقَاكَ وَأَنْتَ رَاضٍ عَنَّا.\n" +
                "اللَّهُمَّ أَنْتَ الَّذِي خَلَقْتَنِي فَأَنْتَ تَهْدِينِ ، وَأَنْتَ الَّذِي تُطْعِمُنِي وَتَسْقِينِ ، وَإذَا مَرِضْتُ فَأَنْتَ تَشْفِينِ ، وَأَنْتَ الَّذِي تُمِيتُنِي ثُمَّ تُحْـيِينِ ، وَأَنْتَ الَّذِي أَطْمَعُ أَنْ يَغْفِرَ لِي خَطِيئَتِي يَوْمَ الدِّينِ ، رَبِّ هَبْ لِي حُكْماً وَأَلْحِقْنِي بِالصَّالِحِينَ ، وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الآخِرِينَ ، وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ ، وَاغْفِرْ لآبَائِنَا وَأُمَّهَاتِنَا مِنَ المُسْلِمِينَ وَلا تُخْزِنِي يَوْمَ يُبْعَثُونَ ، يَوْمَ لا يَنْفَعُ مَالٌ وَلا بَنُونَ ، إِلاَّ مَنْ أَتَى اللهَ بِقَلْبٍ سَلِيمٍ.\n" +
                "اللَّهُمَّ احْفَظْنِي بِالإسْلاَمِ قَائِماً ، وَاحْفَظْنِي بِالإِسْلاَمِ قَاعِداً ، وَاحْفَظْنِي بِالإِسْلامِ رَاقِداً ، وَلاَ تُشْمِتْ بِي عَدُوّاً وَلا حَاسِداً.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ ، وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَـدِكَ.\n" +
                "اللَّهُمَّ يَا ذَا الحَبْلِ الشَّدِيدِ ، وَالأَمْرِ الرَّشِيـدِ ، أَسْأَلُكَ الأَمْنَ يَوْمَ الوَعِيدِ ، وَالجَنَّةَ دَاْر الخُلُودِ ، مَعَ المُقَرَّبِينَ الشُّهُودِ ، الرُّكَّعِ السُّجُودِ ، المُوفِينَ بِالعُهُودِ ، إِنَّكَ رَحِيمٌ وَدُودٌ ، وَإِنَّكَ تَفْعَلُ مَا تُرِيدُ.\n" +
                "اللَّهُمَّ اجْعَلْنَا هَادِينَ مُهْتَدِينَ ، غَيْرَ ضَالِّيْنَ وَلا مُضِلِّينَ ، سِلْماً لأَوْلِيائِكَ ، وَحَرْباً على أَعْدَائِكَ ، نُحِبُّ بِحُبِّكَ مَنْ أَحَبَّكَ ، وَنُعَادِي بِعَدَاوَتِكَ مَنْ خَالَفَكَ.اللَّهُمَّ هَذَا الدُّعَاءُ وَمِنْكَ الإِجَابَةُ ، اللَّهُمَّ هَذَا الجُهْدُ وَعَلَيْكَ التُّكْلانُ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَاناً لا يَرْتَدُّ ، وَنَعِيماً لا يَنْفَدُ ، وَمُرَافَقَةَ نَبِيِّكَ مُحَمَّدٍ فِي أَعْلَى جَنَّةِ الخُلْدِ.\n" +
                "اللَّهُمَّ آتِنِي الحِكْمَةَ الَّتِي مَنْ أُوتِيَهَا فَقَدْ أُوْتِيَ خَيْراً كَثِيراً.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنَ عِبَادَتِكَ.\n" +
                "اللَّهُمَّ ارْحَمْنِي ، فَأَنْتَ خَيْرُ الرَّاحِمِينَ ، وَارْزُقْنِي ، فَأَنْتَ خَيْرُ الرَّازِقِينَ ، وَاغْفِرْ لِي فَأَنْتَ خَيْرُ الغَافِرِينَ ، وَانْصُرْنِي ، فَأَنْتَ خَيْرُ النَّاصِرِينَ.\n" +
                "اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلا تَكِلْني إِلى نَفْسِي طَرْفَةَ عَيْنٍ ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ ، لا إِلَهَ إِلاَّ أَنْتَ.\n" +
                "اللَّهُمَّ زِدْنَا وَلا تَنْقُصْنَا ، وَأَكْرِمْنَا وَلا تُـهِنَّا ، وَأَعْطِنَا وَلا تَحْرِمْنَا ، وَآثِرْنَا وَلا تُؤْثِرْ عَلَينَا ، وَأَرْضِنَا وَارْضَ عَنَّا.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً نَقِيَّةً ، وَمِيتَةً سَـوِيَّةً ، وَمَرَدّاً غَيْرَ مُخْزٍ وَلا فَاضِحٍ.\n", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ ، وَأَنْ أَعْمَلَ صَالِحَاً تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ وَالمُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى ، وَالتُّقَى ، وَالعَفَافَ وَالغِنَى.\n" +
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعَاً ، وَرِزْقاً طَـيِّباً ، وَعَمَلاً مُتَقَبَّلاً.\n" +
                "اللَّهُمَّ اغْفِرْ لِي ، وَاهْدِنِي وَارْزُقْنِي ، وَعَافِنِي ، أَعُوذُ بِاللهِ مِنْ ضِيقِ المَقَامِ يَوْمَ القِيامَةِ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ قِنِي شَرَّ نَفْسِي ، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي ، اللَّهُمَّ اغْفِرْ لِي مَا أَسْرَرْتُ ، وَمَا أَعْلَنْتُ وَمَا أَخْطَأْتُ ، وَمَا عَمَدْتُ ، وَمَا عَلِمْتُ ، وَمَا جَهِلُتُ.\n" +
                "اللَّهُمَّ أَكْثِرْ مَالِي ، وَوَلَدِي ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي ، وَأَطِلْ حَيَاتِي عَلَى طَاعَتِكَ ، وَأَحْسِنْ عَمَلِي وَاغْفِرْ لِي.\n" +
                "اللَّهُمَّ اسْتُرْ عَوَرَاتِي ، وَآمِنْ رَوْعَاتِي ، وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.\n" +
                "اللَّهُمَّ أَكْرِمْنِي وَلا تُهِنِّي ، وَأَعْطِنِي وَلا تَحْرِمْنِي ، وَزِدْنِي وَلا تَنْقُصْنِي ، وَآثِرْنِي وَلا تُؤْثِرْ عَلَيَّ ، وَارْضَ عَنِّي وَأَرْضِنِي.\n" +
                "اللَّهُمَّ افْتَحْ لَنَا فَتْحاً مُبِيناً ، وَاهْدِنَا صِرَاطاً مُسْتَقِيماً ، وَانْصُرْنَا نَصْراً عَزِيزاً، وَأَتِمَّ عَلَيْنَا نَعْمَتَكَ ، وَأَنْزِلْ فِي قُلُوبِنَا سَكِينَتَكَ ، وَانْشُرْ عَلَيْنَا فَضْلَكَ وَرَحْمَتَكَ.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ أعِنَّا عَلَى شَهَوَاتِ أَنْفُسِنَا، وَقَسْوَةِ قُلُوبِنَا ، وَضَعْفِ إِرَادَتِنَا ، وَلا تَكِلْنَا إِلَى أَنْفُسِنَا وَلا إِلَى أَحَدٍ غَيْرَكَ.\n" +
                "اللَّهُمَّ لا تَكِلْنَا إِلَى أَنْفُسِنَا طَرْفَةَ عَيْنٍ وَلا أَقَلَّ مِنْ ذَلِكَ.\n" +
                "اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.\n" +
                "اللَّهُمَّ اشْغَلْ قُلُوبَنَا بِحُبِّكَ ، وَأَلْسِنَتَنَا بِذِكْرِكَ ، وَأَبْدَانِنَا بِطَاعَتِكَ ، وَعُقُولَنَا بِالتَّفَكُّرِ فِي خَلْقِكَ وَالتَّفَقُّهَ فِي دِينِكَ.\n" +
                "اللَّهُمَّ اشْفِ مَرْضَانَا ، وَارْحَمْ مَوْتَانَا ، وعَافِ مُبْتَلاَنَاْ ، وَفُكَّ أَسْرَانَا ، وَاجْبُرْ كَسْرَانَا.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ أَطْعِمْنَا مِنْ جُوعٍ ، وَآمِنَّا مِنْ خَوْفٍ، وَقَوِّنَا مِنْ ضَعْفٍ ، وَعَلِّمْنَا مِنْ جَهَالَةٍ، وَأَنْقِذْنَا مِنْ ضَلاَلَةٍ.\n" +
                "اللَّهُمَّ اخْتِمْ بِالصَّالِحَاتِ أَعْمَالَنَا ، وَبِالسَّعَادَةِ آجَالَنَا ، وَبَلِّغْنَا مِمَّا يُرْضِـيكَ آمَالَنَا.\n" +
                "اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي ، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي, وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي ، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ.\n" +
                "اللَّهُمَّ اجْعَلْ خَيْرَ عُمُرِي أَوَاخِرَهُ ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ ، وَخَيْرَ أَيَّامِي يَوْمَ لِقَاكَ.\n" +
                "اللَّهُمَّ احْفَظْنِي بِالإسْلامِ قَائِماً ، وَاحْفَظْنِي بِالإسْلامِ قَاعِداً ، وَاحْفَظْنِي بِالإِسْلامِ رَاقِداً ، وَلا تُشْمِتْ بِيَ عَدُوَّاً وَلا حَاسِدَاً.", ""));
        ad3ia_5.add(new Model("اللَّهُمَّ أَحْيِنَا مُسْلِمِينَ ، وَتَوَفَّنَا مُسْلِمِينَ ، وَأَلْحِقْنَا بِالصَّالِحِينَ.\n" +
                "اللَّهُمَّ أَبْرِمْ لِهَذِهِ الأُمَّةِ أَمْرَ رُشْدٍ ، يُعَزُّ فِيْهِ أَهْلُ طَاعَتِكَ ، وَيُذَلُّ فِيْهِ أَهْلُ مَعْصِيَتِكَ ، وَيُؤمَرُ فِيْهِ بِالمَعْرُوفِ ، وَيُنْهَى فِيْهِ عَنِ المُنْكَرِ.\n" +
                "اللَّهُمَّ اللهمَّ صلِّ وسلِّمْ وبارِكْ علَى عَبْدِكَ ورَسُوْلِكَ محمَّد وعلى آله وصحبه أجمعين.\n", ""));


        return ad3ia_5;
    }


    // Azkar item  Data
    public ArrayList<ModelAzkar_cc> azkar_0() {
        ArrayList<ModelAzkar_cc> azkar_0 = new ArrayList<>();
        azkar_0.add(new ModelAzkar_cc(1, "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ", "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. ", "[آية الكرسى - البقرة 255]. ", "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. "));
        azkar_0.add(new ModelAzkar_cc(1, "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ", "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.  ", "[البقرة 285 - 286].", "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه."));
        azkar_0.add(new ModelAzkar_cc(3, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم", "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. ", "[سورة الإخلاص]", "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). "));
        azkar_0.add(new ModelAzkar_cc(3, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم", "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ", "[سورة الفلق]", ""));
        azkar_0.add(new ModelAzkar_cc(3, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم", "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ", "[سورة الناس]", ""));
        azkar_0.add(new ModelAzkar_cc(1, "", "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(1, "", "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . ", "", "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."));
        azkar_0.add(new ModelAzkar_cc(3, "", "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. ", "", "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."));
        azkar_0.add(new ModelAzkar_cc(4, "", "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك. ", "", "من قالها أعتقه الله من النار."));
        azkar_0.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. ", "", "من قالها حين يمسى أدى شكر يومه."));
        azkar_0.add(new ModelAzkar_cc(7, "", "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. ", "", "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."));
        azkar_0.add(new ModelAzkar_cc(3, "", "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. ", "", "لم يضره من الله شيء."));
        azkar_0.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(1, "", "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(3, "", "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(3, "", "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(3, "", "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(3, "", "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(1, "", "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(3, "", "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(10, "", "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ", "", "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة."));
        azkar_0.add(new ModelAzkar_cc(3, "", "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(3, "", "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(3, "", "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(3, "", "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ. ", "", ""));
        azkar_0.add(new ModelAzkar_cc(100, "", "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. ", "", "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان. "));
        azkar_0.add(new ModelAzkar_cc(1, "", "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. ", "", "ذكر طيب. "));
        azkar_0.add(new ModelAzkar_cc(100, "", "سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ", "", "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."));
        return azkar_0;
    }

    public ArrayList<ModelAzkar_cc> azkar_1() {
        ArrayList<ModelAzkar_cc> azkar_1 = new ArrayList<>();
        azkar_1.add(new ModelAzkar_cc(1, "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيم", "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.", "[آية الكرسى - البقرة 255].", "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. "));
        azkar_1.add(new ModelAzkar_cc(3, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم", "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. ", "[سورة الإخْلَاص]", "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). "));
        azkar_1.add(new ModelAzkar_cc(3, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم", "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ", "[سورة الفلق]", ""));
        azkar_1.add(new ModelAzkar_cc(3, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم", "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ", "[سورة الناس]", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . ", "", "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."));
        azkar_1.add(new ModelAzkar_cc(3, "", "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. ", "", "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."));
        azkar_1.add(new ModelAzkar_cc(4, "", "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك. ", "", "من قالها أعتقه الله من النار."));
        azkar_1.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. ", "", "من قالها حين يصبح أدى شكر يومه."));
        azkar_1.add(new ModelAzkar_cc(7, "", "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. ", "", "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."));
        azkar_1.add(new ModelAzkar_cc(3, "", "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. ", "", "لم يضره من الله شيء."));
        azkar_1.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(1, "", "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(1, "", "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(10, "", "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ", "", "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة."));
        azkar_1.add(new ModelAzkar_cc(3, "", "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(3, "", "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(1, "", "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا. ", "", ""));
        azkar_1.add(new ModelAzkar_cc(1, "", "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. ", "", "ذكر طيب. "));
        azkar_1.add(new ModelAzkar_cc(100, "", "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. ", "", "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان. "));
        azkar_1.add(new ModelAzkar_cc(100, "", "سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ", "", "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."));
        azkar_1.add(new ModelAzkar_cc(100, "", "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ ", "", "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى."));


        return azkar_1;
    }

    public ArrayList<ModelAzkar_cc> azkar_2() {
        ArrayList<ModelAzkar_cc> azkar_2 = new ArrayList<>();
        azkar_2.add(new ModelAzkar_cc(1, "", "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور. ", "", ""));
        azkar_2.add(new ModelAzkar_cc(1, "", "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه. ", "", ""));
        azkar_2.add(new ModelAzkar_cc(1, "", "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي. ", "", ""));
        return azkar_2;
    }

    public ArrayList<ModelAzkar_cc> azkar_3() {
        ArrayList<ModelAzkar_cc> azkar_3 = new ArrayList<>();
        azkar_3.add(new ModelAzkar_cc(1, "", "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(3, "", "اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(1, "", "بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(1, "", "الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم . ", "", ""));
        azkar_3.add(new ModelAzkar_cc(1, "", "اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(33, "", "سُبْحَانَ اللَّهِ. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(33, "", "الْحَمْدُ لِلَّهِ. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(34, "", "اللَّهُ أَكْبَرُ. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(3, "", "يجمع كفيه ثم ينفث فيهما والقراءة فيهما: {قل هو الله أحد} و{قل أعوذ برب الفلق} و{قل أعوذ برب الناس} ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده. ", "", ""));
        azkar_3.add(new ModelAzkar_cc(1, "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ", "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.", "[البقرة 285 - 286]", "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه."));
        azkar_3.add(new ModelAzkar_cc(1, "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ", "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.", "آية الكرسى[البقرة 255]", "أجير من الجن حتى يصبح."));
        azkar_3.add(new ModelAzkar_cc(1, "أذكار من قلق في فراشه ولم ينم", "عن بريدة رضي الله عنه، قال: شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم فقال: يا رسول الله! ما أنام الليل من الأرق، فقال النبي صلى الله عليه وسلم: إذا أويت إلى فراشك فقل: اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت" +
                "\n" +
                "عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع كلمات: أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون", "", ""));
        azkar_3.add(new ModelAzkar_cc(1, "أذكار الأحلام", "عن أبي قتادة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: الرؤيا الصالحة وفي رواية الرؤيا الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا تضره. ", "", ""));


        return azkar_3;
    }

    public ArrayList<ModelAzkar_cc> azkar_4() {
        ArrayList<ModelAzkar_cc> azkar_4 = new ArrayList<>();
        azkar_4.add(new ModelAzkar_cc(1, "دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ", "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا. ", "", ""));
        azkar_4.add(new ModelAzkar_cc(1, "دُعَاءُ دُخُولِ المَسْجِد", "يَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُولُ:" + "\n" +
                "أَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله، اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك.", "", ""));
        azkar_4.add(new ModelAzkar_cc(1, "دُعَاءُ الخُرُوجِ مِنَ المَسْجِدِ", "يَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ:" + "\n" +
                "بِسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم.", "", ""));


        return azkar_4;
    }

    public ArrayList<ModelAzkar_cc> azkar_5() {
        ArrayList<ModelAzkar_cc> azkar_5 = new ArrayList<>();
        azkar_5.add(new ModelAzkar_cc(1, "ما يقال عند سماع الأذان", "يَقُولُ مِثْلَ مَا يَقُولُ الـمُؤَذِّنُ إلاَّ فِي حَيَّ عَلَى الصَّلاةِ وَحَيَّ عَلَى الفَلاَحِ فَيَقُولُ: لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّه. ", "", ""));
        azkar_5.add(new ModelAzkar_cc(1, "", "عنْ سَعْدِ بْن أَبي وقَّاصٍ رضِيَ اللَّه عنْهُ عَن النبي صَلّى اللهُ عَلَيْهِ وسَلَّم أَنَّهُ قَالَ: مَنْ قَال حِينَ يسْمعُ المُؤذِّنَ : أَشْهَد أَنْ لا إِله إِلاَّ اللَّه وحْدهُ لا شَريك لهُ ، وَأَنَّ مُحمَّداً عبْدُهُ وَرسُولُهُ ، رضِيتُ بِاللَّهِ ربًّا ، وبمُحَمَّدٍ رَسُولاً ، وبالإِسْلامِ دِينًا ، غُفِر لَهُ ذَنْبُه.  ", "رواه مسلم .", ""));
        azkar_5.add(new ModelAzkar_cc(1, "", "عَنْ عبْدِ اللَّهِ بْنِ عَمرِو بْنِ العاصِ رضِيَ اللَّه عنْهُما أَنه سَمِع رسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم يقُولُ : إِذا سمِعْتُمُ النِّداءَ فَقُولُوا مِثْلَ ما يَقُولُ ، ثُمَّ صَلُّوا علَيَّ ، فَإِنَّهُ مَنْ صَلَّى علَيَّ صَلاةً صَلَّى اللَّه عَلَيْهِ بِهَا عشْراً ، ثُمَّ سلُوا اللَّه لي الْوسِيلَةَ ، فَإِنَّهَا مَنزِلَةٌ في الجنَّةِ لا تَنْبَغِي إِلاَّ لعَبْدٍ منْ عِباد اللَّه وَأَرْجُو أَنْ أَكُونَ أَنَا هُو ، فَمنْ سَأَل ليَ الْوسِيلَة حَلَّتْ لَهُ الشَّفاعَةُ.", "رواه مسلم .", ""));
        azkar_5.add(new ModelAzkar_cc(1, "", "عَنْ جابرٍ بن عبد الله رضَي اللَّه عنهما أَنَّ رَسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم قَالَ : من قَال حِين يسْمعُ النِّداءَ : اللَّهُمَّ رَبَّ هذِهِ الدَّعوةِ التَّامَّةِ ، والصَّلاةِ الْقَائِمةِ، آت مُحَمَّداً الْوسِيلَةَ ، والْفَضَيِلَة، وابْعثْهُ مقَامًا محْمُوداً الَّذي وعَدْتَه ، حلَّتْ لَهُ شَفَاعتي يوْم الْقِيامِة. ", "رواه البخاري .", ""));
        azkar_5.add(new ModelAzkar_cc(1, "ما يقال بعد سماع الأذان", "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ.\n" +
                "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، والصَّلاةِ القَائِمَةِ، آتِ مُـحَمَّداً الوَسِيْلَةَ والفَضِيْلَةَ، وابْعَثْهُ مَقَاماً مَـحْمُوداً الَّذِي وَعَدْتَهُ، إنَّكَ لا تُخْلِفُ الـمِيْعَادِ.", "", ""));
        azkar_5.add(new ModelAzkar_cc(1, "ما يقال بين الأذان والإقامة", "ما بين الأذان والإقامة فالدعاء عندئذٍ مرغّب فيه ومستحب.\n" +
                "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"الدُّعَاءُ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ\".\n" +
                "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"إِنَّ الدُّعَاءَ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَادْعُوا\".", "", ""));
        azkar_5.add(new ModelAzkar_cc(1, "نص صيغة الأذان", "اللهُ أكْبَرُ ، اللهُ أكْبَرُ\n" +
                "اللهُ أكْبَرُ ، اللهُ أكْبَرُ\n" +
                "أشْهَدُ أنَّ لا إلَهَ إلاَّ اللهُ\n" +
                "أشْهَدُ أنَّ لا إلَهَ إلاَّ اللهُ\n" +
                "أشْهَدُ أنَّ مُحَمَّداً رَسُولُ اللهِ\n" +
                "أشْهَدُ أنَّ مُحَمَّداً رَسُولُ اللهِ\n" +
                "حَيَّ عَلَى الصَّلاةِ\n" +
                "حَيَّ عَلَى الصَّلاةِ\n" +
                "حَيَّ عَلَى الفَلاحِ\n" +
                "حَيَّ عَلَى الفَلاحِ\n" +
                "اللهُ أكْبَرُ ، اللهُ أكْبَرُ\n" +
                "لاَ إلَهَ إلاَّ اللهُ", "", ""));
        azkar_5.add(new ModelAzkar_cc(1, "نص صيغة أذان الفجر", "اللهُ أكْبَرُ ، اللهُ أكْبَرُ\n" +
                "اللهُ أكْبَرُ ، اللهُ أكْبَرُ\n" +
                "أشْهَدُ أنَّ لا إلَهَ إلاَّ اللهُ\n" +
                "أشْهَدُ أنَّ لا إلَهَ إلاَّ اللهُ\n" +
                "أشْهَدُ أنَّ مُحَمَّداً رَسُولُ اللهِ\n" +
                "أشْهَدُ أنَّ مُحَمَّداً رَسُولُ اللهِ\n" +
                "حَيَّ عَلَى الصَّلاةِ\n" +
                "حَيَّ عَلَى الصَّلاةِ\n" +
                "حَيَّ عَلَى الفَلاحِ\n" +
                "حَيَّ عَلَى الفَلاحِ\n" +
                "الصلاةُ خيرٌ مِنَ النوم\n" +
                "الصلاةُ خيرٌ من النوم\n" +
                "اللهُ أكْبَرُ ، اللهُ أكْبَرُ\n" +
                "لاَ إلَهَ إلاَّ اللهُ", "", ""));
        azkar_5.add(new ModelAzkar_cc(1, "نص صيغة الإقامة", "اللهُ أكْبَرُ ، اللهُ أكْبَرُ\n" +
                "أشْهَدُ أنَّ لا إلَهَ إلاَّ اللهُ\n" +
                "أشْهَدُ أنَّ مُحَمَّداً رَسُولُ اللهِ\n" +
                "حَيَّ عَلَى الصَّلاةِ\n" +
                "حَيَّ عَلَى الفَلاحِ\n" +
                "قد قامت الصلاةُ\n" +
                "قد قامت الصلاةُ\n" +
                "اللهُ أكْبَرُ ، اللهُ أكْبَرُ\n" +
                "لاَ إلَهَ إلاَّ اللهُ", "", ""));


        return azkar_5;
    }

    public ArrayList<ModelAzkar_cc> azkar_6() {
        ArrayList<ModelAzkar_cc> azkar_6 = new ArrayList<>();
        azkar_6.add(new ModelAzkar_cc(1, "أدعية استفتاح الصلاة", "اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللهم نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأبْيَضُ مِنَ الدَّنَسِ، اللهم اغْسِلْنِيْ مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ والْبَرَدِ.\n" +
                "سُبْحَانَكَ سُبْحَانَكَ اللهم وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ.\n" +
                "الْحَمْدُ الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.\n" +
                "اللهُ أكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَّاصِيْلًا. أعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ.\n" +
                "اللَّهُمَّ رَبَّ جَبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيْلَ، فَاطِرَ السَّمَوَاتِ وَالْأرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوا فِيْهِ يَخْتَلِفُونَ، اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ.\n" +
                "وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَوَاتِ وَالْأرْضَ حَنِيْفًا وَّمَا أنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلَاتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلهِ رَبِّ الْعَالَمِيْنَ، لَا شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَانَا مِنَ الْمُسْلِمِيْنَ، اللهم أنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أنْتَ، أنْتَ رَبِّيْ وَأنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لَا يَغْفِرُ الذُّنوبَ إِلَّا أنْتَ. وَاهْدِنِيْ لِأحْسَنِ الْأخْلَاقِ لَا يَهْدِيْ لِأحْسَنِهَا إِلَّا أنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أسْتَغْفِرُكَ وَأتُوْبُ إِلَ", "", ""));
        azkar_6.add(new ModelAzkar_cc(1, "أدعية الركوع", "سُبْحانَ رَبِّيَ الْعَظِيْمِ. ثلاث مراتٍ أو أكثر.\n" +
                "سُبْحَانَ رَبِّيَ العَظِيمِ وَبِحَمْدِهِ. ثلاث مراتٍ.\n" +
                "سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي.\n" +
                "سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلَائِكَةِ وَالرُّوْحِ.\n" +
                "سُبْحَانَ ذِيْ الْجَبَرُوْتِ، وَالْمَلَكُوْتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ.\n" +
                "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي وَبَصَرِي، وَمُخِّي وَعَظْمِي وَعَصَبِي.", "", ""));
        azkar_6.add(new ModelAzkar_cc(1, "أدعية الرفع من الركوع", "سَمِعَ اللهُ لِمَنْ حَمِدَهُ.\n" +
                "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبارَكًا فِيْهِ.\n" +
                "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ اسْلَمْتُ، خَشَعَ لَكَ سَمْعِيْ، و بَصَـرِيْ، وَمُخِّيْ، وَعَظْمِيْ، وَعَصَبِيْ، وَمَا استَقَلَّتْ بِهِ قَدَمِيْ لِلهِ رَبِّ الْعَالَمِيْنَ.\n" +
                "اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْارْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، أهْلَ الثَّنَاءِ وَالْمَجْدِ، أحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ، اللهم لَا مَانِعَ لِمَا أعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الْجَدُّ.\n" +
                "اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ، وَمِلْءَ الْارْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ، وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْابْيَضُ مِنَ الْوَسَخِ.", "", ""));
        azkar_6.add(new ModelAzkar_cc(1, "أدعية السجود", "سُبْحَانَ رَبِّيَ الأَعْلَى. ثلاث مرات أو أكثر.\n" +
                "سُبْحَانَ رَبِّيَ الأعْلَى وَبِحَمْدِهِ. ثلاث مرات.\n" +
                "سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ.\n" +
                "سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي.\n" +
                "سُبْحَانَ ذِي الْجَبْرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ.\n" +
                "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ.\n" +
                "اللَّهُمَّ لَكَ سَجَدْتُّ وَبِكَ آمَنْتُ، وَلَكَ أسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِيْ خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ أحْسَنُ الْخَالِقيْنَ.\n" +
                "اللَّهُمَّ إِنِّيْ أعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لَا أُحْصِـي ثَنَاءً عَلَيْكَ، أنْتَ كَمَا أثْنَيْتَ عَلَى نَفْسِكَ.\n" +
                "رَبِّ اعْطِ نَفْسِي تَقْوَاهَا زَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا أنْتَ وَلِيُّهَا وَمَوْلَاهَا.\n" +
                "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَاجْعَلْ فِيْ سَمْعِيْ نُورًا وَاجْعَلْ فِيْ بَصَرِيْ نُورًا وَاجْعَلْ مِنْ تَحْتِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ يَسَارِي نُورًا وَاجْعَلْ أمَامِي نُورًا وَاجْعَلْ خَلْفِي نُورًا وَأعْظِمْ لِيْ نُورًا.\n", "بعد أن يختار أحد أدعية السجود ، يسن له أن يدعوا بما شاء ،لأن \"أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ، فَأَكْثِرُوا الدُّعَاء.", ""));
        azkar_6.add(new ModelAzkar_cc(1, "أدعية الجلوس بين السجدتين", "رَبِّ رَبِّ اغْفِرْ لِيْ، رَبِّ اغْفِرْ لِيْ.\n" +
                "اللَّهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَاهْدِنِيْ، وَاجْبُرْنِيْ، وَعَافِنِيْ، وَارْزُقْنِيْ، وَارْفَعْنِيْ.\n", "كان النبي صلى الله عليه وسلم يطيل هذا الركن بقدر السجود.\n", ""));
        azkar_6.add(new ModelAzkar_cc(1, "دعاء سجود التلاوة", "سَجَدَ وَجْهِيَ للَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللَّهُ أَحْسَنُ الْـخَالِقِينَ.\n" +
                "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أجْراً، وَضَعْ عَنِّي بِهَا وِزْرَاً، واْجعَلْهَا لِي عِنْدِكَ ذُخْراً، وتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ.\n", "", ""));
        azkar_6.add(new ModelAzkar_cc(1, "التشهد الأول", "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.\n" +
                "\n", "", "وردت صيغ أخرى للتشهد قريبة من هذا.\n"));
        azkar_6.add(new ModelAzkar_cc(1, "التشهد الأخير", "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ. اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.\n" +
                "\n", "", ""));
        azkar_6.add(new ModelAzkar_cc(1, "أدعية بعد التشهد الأخير وقبل السلام", "اللَّهُمَّ إِنِّيْ أعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ.\n" +
                "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَم ِ.\n" +
                "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً ، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.\n" +
                "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ. وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ. وَمَا أَسْرَفْتُ. وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ. لاَ إِلهَ إِلاَّ أَنْتَ.\n" +
                "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.\n" +
                "اللَّهُمَّ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ.\n" +
                "اللَّهُمَّ إِنِّيْ أسْألُكَ يَا أللهُ بِأنَّكَ الْوَاحِدُ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ، وَلَمْ يَكنْ لَهُ كُفُوًا أحَدٌ، أنْ تَغْفِرَ لِيْ ذُنُوْبِيْ إِنَّكَ أنْتَ الْغَفُوْرُ الرَّحِيْمُ.\n" +
                "اللَّهُمَّ حَاسِبْنِيْ حِسَابَاً يَسِيراً.\n" +
                "اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّ لَكَ الْحَمْدُ لَا إِلَهَ إِلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْارْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ.\n" +
                "اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّيْ أشْهَدُ أنَّكَ أنْتَ اللهُ لَا إِلَهَ إِلَّا أنْتَ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أحَدٌ.\n" +
                "اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِيْ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِيْ، اللهم إِنِّيْ أسْألُكَ خَشْيَتَكَ فِيْ الْغَيْبِ وَالشَّهَادَةِ، وَأسْألُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأسْألُكَ الْقَصْدَ فِيْ الْغِنَى وَالْفَقْرِ، وَأسْألُكَ نَعِيْمًا لَا يَنْفَدُ، وَأسْألُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأسْألُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأسْألُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأسْألُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللهم زَيِّنَّا بِزِينَةِ الْإِيْمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِيْنَ.", "", ""));
        azkar_6.add(new ModelAzkar_cc(1, "دعاء القنوت", "اللَّهُمَّ اهْدِني فيمَنْ هدَيْت، وعَافِنِي فيمَنْ عافيتَ، وتَوَلَّني فيمن تَولَّيت، وبارِك لي فيمَا أعطيت، وقِني شرَّ ما قَضَيْت، فإنَّك تقضي ولا يُقْضَى عَليك، إنَّه لا يَذلُّ من واليت، تباركت ربنا وتعاليت.\n" +
                "اللَّهُمَّ إني أعُوذُ بِرضَاك من سَخَطِك وأعُوذُ بمُعافاتك مِنْ عُقوبَتِك، وأعُوذُ بِكَ مِنْكَ لا أُحْصِي ثناءً عليكَ، أنْتَ كما أثنيت على نفسك.\n" +
                "اللَّهُمَّ إيَّاك نعبُدُ، ولك نُصلِّي ونسجُدُ، وإليك نسعَى ونَحْفِد، نرجُو رحمتك، ونخشى عذابَكَ، إنَّ عذابَكَ بالكافرين مُلْحِقٌ، اللَّهُمَّ إنَّا نستعينُكَ، ونستغفرك، ونُثْنِي عليكَ الخيرَ، ولا نَكْفُرُك، ونُؤمِنُ بِكَ ونَخْضَعُ لَك، ونَخْلَعُ من يكفُرُك.\n" +
                "اللَّهُمَّ تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ. وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلى آلِهِ وَصَحْبِهِ وَسَلمَ.", "", ""));
        azkar_6.add(new ModelAzkar_cc(1, "دعاء خطبة الجمعة", "ربناَّ لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة انك أنت الوهاب وأصلح اللهم أحوالنا في الأمور كلها وبلغنا بما يرضيك أمالنا واختم اللهم بالصالحات أعمالنا وبالسعادة أجالنا وتوفنا يا رب وأنت راض عنا.\n" +
                "اللَّهُمَّ اجعل جمعنا هذا جمعا مباركا مرحوما وتفرقنا من كل شر معصوما.\n" +
                "ربنا لا تدع لنا ذنبا إلا غفرته ولا هما إلا فرجته ولا مريضا إلا شفيته ولا ميتا إلا رحمته ولا طالبا أمرا من أمور الخير إلا سهلته له ويسرته.\n" +
                "اللَّهُمَّ وحد كلمة المسلمين واجمع شملهم واجعلهم يدا واحدة على من سواهم وانصر اللهم المسلمين واخذل الكفرة المشركين أعدائك أعداء الدين.\n" +
                "اللَّهُمَّ إنا نسألك لولاة أمورنا الصلاح والسداد.\n" +
                "اللَّهُمَّ كن لهم عونا وخذ بأيديهم إلى الحق والصواب والسداد والرشاد ووفقهم للعمل لما فيه رضاك وما فيه صالح العباد والبلاد.\n" +
                "اللَّهُمَّ إنا نسألك لبلدنا هذا اللهم اجعله بلدا ءامنا وارزقه من كل الخيرات وجنبه الفتن ما ظهر منها وما بطن وألف اللهم ما بين قلوبنا وبين قلوب أبناء هذا الوطن واجعلهم اللهم يا ربنا باسمك متحابين وعلى نصرة دينك متعاونين.\n" +
                "اللَّهُمَّ إنا نستعيذ بك من شر ما خلقت ومن كل عين حاسد و نسألك اللهم التوفيق والسداد والهداية والرشاد وحسن العقبى وحسن الميعاد.\n" +
                "اللَّهُمَّ أسبغ علينا نعمتك وعلى جميع المسلمين واملء اللهم قلوبنا بالإيمان والقناعة والزم جوارحنا العبادة والطاعة واغفر اللهم لنا ولوالدينا ولإخواننا وأشياخنا ولجميع من سبقنا بالإيمان واتنا من لدنك رحمة وهيئ لنا من امرنا رشدا واتنا ربنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار.\n" +
                "سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين.", "", ""));


        return azkar_6;
    }

    public ArrayList<ModelAzkar_cc> azkar_7() {
        ArrayList<ModelAzkar_cc> azkar_7 = new ArrayList<>();
        azkar_7.add(new ModelAzkar_cc(1, "الذكر قبل الوضوء\n", "قبل الوضوء: \"بِسْمِ ٱللّٰهِ\". ", "", ""));
        azkar_7.add(new ModelAzkar_cc(0, "الذكر بعد الوضوء\n", "\"أشْهَدُ أن لا إله إلا الله وحْدَهُ لا شريكَ لهُ ، وأشْهَدُ أنَّ محمداً عَبدُهُ ورسُولُه\".\n" +
                "\"اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ\".\n" +
                "\"سُبْحَانَكَ اللَّهُمَّ وبَحَمْدكَ أشْهدُ أنْ لا إلهَ إلا أنْتَ أَسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ\". ", "", ""));


        return azkar_7;
    }

    public ArrayList<ModelAzkar_cc> azkar_8() {
        ArrayList<ModelAzkar_cc> azkar_8 = new ArrayList<>();
        azkar_8.add(new ModelAzkar_cc(1, "الذكر عند الخلاء\n", "(بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث. ", "", ""));
        azkar_8.add(new ModelAzkar_cc(1, "الذكر بعد الخروج من الخلاء\n", "غُفْـرانَك. ", "", ""));


        return azkar_8;
    }

    public ArrayList<ModelAzkar_cc> azkar_9() {
        ArrayList<ModelAzkar_cc> azkar_9 = new ArrayList<>();
        azkar_9.add(new ModelAzkar_cc(1, "أذكار الدخول إلى المنزل\n", "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا. ", "", ""));
        azkar_9.add(new ModelAzkar_cc(0, "أذكار الخروج من المنزل\n", "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله.\n" +
                "اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـل ، أَوْ أَزِلَّ أَوْ أُزَل ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـم ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيّ.", "", ""));


        return azkar_9;
    }

    public ArrayList<ModelAzkar_cc> azkar_10() {
        ArrayList<ModelAzkar_cc> azkar_10 = new ArrayList<>();
        azkar_10.add(new ModelAzkar_cc(1, "الذكر عند الطعام والشراب\n", "بِسْمِ اللهِ.\n" +
                "فإنْ نسي في أَوَّلِهِ، فَليَقُلْ:\n" +
                "بِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ.", "", ""));
        azkar_10.add(new ModelAzkar_cc(1, "الذكر عند شرب اللبن\n", "اَللَّهُمَّ بَارِكْ لَنَا فِيهِ, وَزِدْنَا مِنْهُ. ", "", ""));
        azkar_10.add(new ModelAzkar_cc(1, "الذكر عند الفراغ من الطعام والشراب\n", "الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّةٍ.\n" +
                "الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا. ", "غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.\n", ""));
        azkar_10.add(new ModelAzkar_cc(1, "أذكار الضيف\n", "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ ، وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ ، وَصَلَّتْ عَلَيْكُمُ الْمَلائِكَةُ. ", "", ""));
        azkar_10.add(new ModelAzkar_cc(1, "هدى النبى فى الشرب\n", "كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ. ", "", ""));

        return azkar_10;
    }

    public ArrayList<ModelAzkar_cc> azkar_11() {
        ArrayList<ModelAzkar_cc> azkar_11 = new ArrayList<>();
        azkar_11.add(new ModelAzkar_cc(1, "قد ربط الله تعالى بين الحج والذكر فجعله من أهم مقاصد الركن الخامس من أركان الدين، قال تعالى :\n" +
                "\n" +
                "\"وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ \". [سورة البقرة - الآية 203]\n" +
                "وقال تعالى :\n" +
                "\n" +
                "\"وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالاً وَعَلَى كُلِّ ضَامِرٍ يَأْتِينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ ﴿27﴾ لِيَشْهَدُوا مَنَافِعَ لَهُمْ وَيَذْكُرُوا اسْمَ اللَّهِ فِي أَيَّامٍ مَعْلُومَاتٍ عَلَى مَا رَزَقَهُمْ مِنْ بَهِيمَةِ الْأَنْعَامِ\". [سورة الحج - الآية 28]\n" +
                "فجعل من أهم مقاصد الحج أن يقوم العبد بذكر الله وشكره.\n" +
                "\n" +
                "وأكد النبي صلى الله عليه وسلم ارتباط الحج بذكر الله فقال صلى الله عليه وسلم:\n" +
                "\n" +
                "\" إِنَّمَا جُعِلَ الطَّوَافُ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ وَرَمْيُ الْجِمَارِ لِإِقَامَةِ ذِكْرِ اللَّهِ\". [رواه أبو داود والترمذي]\n" +
                "وهكذا يتجلى شأن الذكر في الحج، ويستبين عظم منزلته ورفيع مكانته. وفيما يلي الأدعية النبوية والأذكار الواردة في محطات الحج ومواقيته الزمانية والمكانية والعمرة والزيارة فاحفظها ليكون حجك مبرورا وسعيك مشكورا.", "", "", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الذكر عند الاحرام\n", "\"سُبْحَانَ اللهِ وَالحَمْدُ للهِ وَالله أَكْبَرُ\"\n", "", ""));
        azkar_11.add(new ModelAzkar_cc(1, "دعاء التلبية في الحج والعمرة\n", "\"لَبَّيْكَ اللَّهُمَّ لَبَّيْك، لَبّيْك لا شَرِيكَ لك لَبَّيْك إنَّ الحَمْدَ، والنِّعْمَةَ، لَكَ والمُلْك، لا شريك لك\".", " [البخاري (2/ 170)، ومسلم (1184)]", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء عند رؤية الكعبة\n", "\"اللهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، فَحَيِّنَا رَبَّنَا بِالسَّلَامِ\".", " [أبي شيبة 7/ 102، والبيهقي 5/ 73]\n", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء عند استلام الحجر الأسود\n", "\"بِاسْمِ اللهِ وَاللهُ أَكْبَرُ\". [الطبراني (862)، (863)، والبيهقي (5/ 79)]\n\"لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ، اللَّهُمَّ تَصْدِيقًا بِكِتَابِكَ، وَسُنَّةِ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\". [الطبراني (865)]\n", "", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدُّعاءُ بينَ الرُّكن اليماني والحجر الأسود\n", "\"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ\". ", "[أبو داود 2/179 وأحمد 3/411]", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء في الطواف\n", "\"اللهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\".\n" +
                "\"لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\".", "[الطبراني (857)، والبيهقي (5/ 84)]", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء بعد ركعتي الطواف\n", "اللَّهُمَّ اعْصِمْنِي بِدِينِكَ، وَطَاعَةِ رَسُولِكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.\n" +
                "اللَّهُمَّ جَنِّبْنِي حُدُودَكَ.\n" +
                "اللَّهُمَّ اجْعَلْنِي مِمَّنْ يُحِبُّكَ، وَيُحِبُّ مَلَائِكَتَكَ، وَرُسُلَكَ، وَعِبَادَكَ الصَّالِحِينَ اللَّهُمَّ حَبِّبْنِي إِلَيْكَ، وَإِلَى مَلَائِكَتِكَ، وَرُسُلِكَ، وَعِبَادَكَ الصَّالِحِينَ.\n" +
                "اللَّهُمَّ آتِنِي مِنْ خَيْرِ مَا تُؤْتِي عِبَادَكَ الصَّالِحِينَ فِي الدُّنْيَا وَالْآخِرَةِ.\n" +
                "اللَّهُمَّ يَسِّرْنِي لِلْيُسْرَى، وَجَنِّبْنِي الْعُسْرَى، وَاغْفِرْ.", "", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء عند صعود الصَّفَا والمروة\n", "عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رضي الله عنه، قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حِينَ خَرَجَ مِنَ الْمَسْجِدِ يُرِيدُ الصَّفَا، يَقُولُ: \"نَبْدَأُ بِمَا بَدَأَ بِهِ\" فَبَدأَ بِالصَّفَا، وَقَرَأَ: {إِنَّ الصَّفَا وَالمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ} وَكَانَ إِذَا وَقَفَ عَلَى الصَّفَا يُكَبِّرُ ثَلاثًا، وَيَقُولُ:\n" +
                "\"لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ\".\n" +
                "ثُمَّ أعاد هذا الكلام. ", "[مسلم (1218)، وأحمد (3/ 320، 321)]", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء على الصفا\n", "\"اللَّهُمَّ إِنَّكَ قُلْتَ: {اِدْعُونِي أَسْتَجِبْ لَكُمْ} وَإِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ، وَإِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي إِلَى الإِسْلاَمِ أَلاَ تَنْزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي، وَأَنَا مُسْلِمٌ\".\n" +
                "\"اللَّهُمَّ اعْصِمْنَا بِدِينِكَ، وَطَوَاعِيَتِكَ، وَطَوَاعِيَةِ رَسُولِكَ، وَجَنِّبْنَا حُدُودَكَ\".\n" +
                "\"اللَّهُمَّ اجْعَلْنَا نُحِبُّكَ، وَنُحِبُّ مَلَائِكَتَكَ، وَأَنْبِيَاءَكَ، وَرُسَلَكَ، وَنُحِبُّ عِبَادَكَ الصَّالِحِينَ\".\n" +
                "\"اللَّهُمَّ حَبِّبْنَا إِلَيْكَ وَإِلَى مَلَائِكَتِكَ، وَإِلَى أَنْبِيَائِكَ، وَرُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ\".\n" +
                "\"اللَّهُمَّ يَسِّرْنَا لِلْيُسْرَى، وَجَنِّبْنَا وَجَنِّبْنَا الْعُسْرَى، وَاغْفِرْ لَنَا فِي الْآخِرَةِ\".", "[البيهقي (5/ 94)]", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء في السعي بين الصفا والمروة\n", "\"رَبِّ اغْفِرْ وَارْحَمْ إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ\".", "[الطبراني (870)، والبيهقي (5/ 95)]", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء بعرفات\n", "\"لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\".", "[الترمذي (3579)، والطبراني (784)]", ""));
        azkar_11.add(new ModelAzkar_cc(1, "دعاء السلف الصالح في عرفات\n", "\"لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\".\n" +
                "\"اللَّهُمَّ اهْدِنَا بِالْهُدَى، وَزَيِّنَّا بِالتَّقْوَى، وَاغْفِرْ لَنَا فِي الْآخِرَةِ وَالْأُولَى\".\n" +
                "\"ثُمَّ يَخْفِضُ صَوْتَهُ، ثُمَّ يَقُولُ: اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَعَطَائِكَ رِزْقًا طَيِّبًا مُبَارَكًا\".\n" +
                "\"اللَّهُمَّ إِنَّكَ أَمَرْتَ بِالدُّعَاءِ، وَقَضَيْتَ عَلَى نَفْسِكَ بِالِاسْتِجَابَةِ، وَأَنْتَ لَا تُخْلِفُ وَعْدَكَ، وَلَا تَكْذِبُ عَهْدَكَ، اللَّهُمَّ مَا أَحْبَبْتَ مِنْ خَيْرٍ فَحَبِّبْهُ إِلَيْنَا، وَيَسِّرْهُ لَنَا، وَمَا كَرِهْتَ مِنْ شَيْءٍ فَكَرِّهْهُ إِلَيْنَا وَجَنِّبْنَاهُ، وَلَا تَنْزِعْ عَنَّا الْإِسْلَامَ بَعْدَ إِذْ أَعْطَيْتَنَا\".", "", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الدعاء عند رمي جمرة العقبة عِنْدَ كُلِّ حَصَاة\n", "\"الله أَكْبَر، الله أَكْبَر، الله أَكْبَر\".\n" +
                "\"اللَّهُمَّ اجْعَلْهُ حَجًّا مَبْرُورًا وَذَنْبًا مَغْفُورًا\".", "[الطبراني (881)، والبيهقي (5/ 129)]", ""));
        azkar_11.add(new ModelAzkar_cc(1, "الذكر عند ذبح الأضاحي\n", "بسم الله , اللهم تقبل من محمد وآل محمد ومن أمة محمد\n", "", ""));
        azkar_11.add(new ModelAzkar_cc(1, "دعاء الرجوع من الحج أو العمرة\n", "\"الله أَكْبَر، الله أَكْبَر، الله أَكْبَر\".\n" +
                "\"لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، سَاجِدُونَ\".\n" +
                "\"اَللّٰهُمَّ اجْعَلْهُ حَجًّا مَبْرُوْرًا وَسَعْيًا مَشْكُوْرًا وَذَنْبًا مَغْفُوْرًا\".", "", ""));

        return azkar_11;
    }

    public ArrayList<ModelAzkar_cc> azkar_12() {
        ArrayList<ModelAzkar_cc> azkar_12 = new ArrayList<>();


        return azkar_12;
    }


    // Elseb7a item Data
    public ArrayList<ModelElseb7a> elseb7a0() {
        ArrayList<ModelElseb7a> elseb7a0 = new ArrayList<>();
        elseb7a0.add(new ModelElseb7a(100, "سُبْحَانَ اللَّهِ"));
        elseb7a0.add(new ModelElseb7a(100, "سُبْحَانَ اللَّهِ وَبِحَمْدِهِِ"));
        elseb7a0.add(new ModelElseb7a(100, "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ ِِ"));
        elseb7a0.add(new ModelElseb7a(100, "سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ"));
        elseb7a0.add(new ModelElseb7a(100, "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِِ"));
        elseb7a0.add(new ModelElseb7a(100, "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِِِ"));
        elseb7a0.add(new ModelElseb7a(100, "لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ ِِ"));
        elseb7a0.add(new ModelElseb7a(100, "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ِ"));
        elseb7a0.add(new ModelElseb7a(100, "الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّدِ"));
        elseb7a0.add(new ModelElseb7a(100, "أستغفر اللهِِ"));
        elseb7a0.add(new ModelElseb7a(100, "سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ ِِِ"));
        elseb7a0.add(new ModelElseb7a(100, "لَا إِلَهَ إِلَّا اللَّهُِِ"));
        elseb7a0.add(new ModelElseb7a(100, "سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي."));
        elseb7a0.add(new ModelElseb7a(100, "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ."));
        elseb7a0.add(new ModelElseb7a(100, "اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً.ِ"));
        elseb7a0.add(new ModelElseb7a(100, "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ"));

        return elseb7a0;
    }

    // Home Rv Data
    public ArrayList<ModelRvHome> HomeRvData() {
        ArrayList<ModelRvHome> HomeRvData = new ArrayList<>();


        HomeRvData.add(new ModelRvHome(R.drawable.ic_rv_home_icon_1, "حصن المسلم"));
        HomeRvData.add(new ModelRvHome(R.drawable.ic_rv_home_icon_8, "سنن"));
        HomeRvData.add(new ModelRvHome(R.drawable.ic_rv_home_icon_7, "الرقية الشرعية"));

        return HomeRvData;
    }

    public ArrayList<Model> HomeRv_item_0() {
        ArrayList<Model> HomeRv_item_0 = new ArrayList<>();
        HomeRv_item_0.add(new Model("مقدمة", "#5a5a5a", "إن الحمد لله ، نحمده ونستعينهُ ، ونستغفرهُ ونعوذُ باللهِ من شرورِ أنفسنا ، وسيئاتِ أعمالنا ، من يهده الله فلا مضل لهُ، ومن يضلل فلا هادي له ، وأشهد أن لا إله إلا الله وحده لا شريك لهُ،وأشهدُ أن محمداً عبدهُ ورسولهُ صلى الله عليه وعلى أله وأصحابه ومن تبعهم بإحسان إلى يوم الدين وسلم تسليما كثيراً ،أما بعد .\n" +
                "\n" +
                "فهذا مختصر اختصرته من كتابي (( الذكرُ والدعاءُ والعلاج بالرقي من الكتاب والسنة )) اختصرت فيه قسم الأذكار ؛ ليكون خفيف الحمل في الأسفار .\n" +
                "\n" +
                "وقد اقتصرت على متن الذكر ، واكتفيت في تخريجه بذكر مصدر أو مصدرين مما وجد في الأصل ،ومن أراد معرفة الصحابي أو زيادة في التخريج فعليه بالرجوع إلى الأصل.\n" +
                "\n" +
                "وأسأل الله عز وجل بأسمائه الحسنى ، وصفاته العُلى أن يجعله خالصا لوجهه الكريم ، وأن ينفعني به في حياتي وبعد مماتي وأن ينفع به من قرأه ، أو طبعه ، أو كان سبباً في نشره إنه سبحانه ولي ذلك  والقادر عليه. وصلى الله على نبينا محمد وعلى آله وأصحابه ومن تبعهم بإحسان إلى يوم الدين.\n" +
                "\n" +
                "المؤلف حرر في شهر صفر 1409هـ"));
        HomeRv_item_0.add(new Model("دعاء لبس الثوب", "#5a5a5a", "مَنْ لَبِسَ ثَوْباًً فقال: الحَمْدُ لله الذِي كَساني هذا( الثوب ) ورَزَقَنِيه مِنْ غَيْرِ حَوْلٍ مِنّي ولا قُوةٍ\n" +
                "\n" +
                "1- أخرجه أهل السنن إلا النسائي انظر إرواء الغليل 7/ 47 ."));
        HomeRv_item_0.add(new Model("دعاء لبس الثوب الجديد", "#5a5a5a", "\" اللَّهُمَّ لَكَ الحَمْدُ أَنْتَ كَسَوتَنِيه،أسْألك مِنْ خَيرِهِ وخَيْرَ ما صُنع لَهُ،وأعُوذُ بِكَ مِنْ شرِّه وشَرَّ ما صُنِعَ لَهُ \"[1]\n" +
                "\n" +
                "1 –  أبو داود والترمذي والبغوي وانظر مختصر شمائل الترمذي للألباني ص 47"));
        HomeRv_item_0.add(new Model("الدعاء اذا تقلب ليلاً", "#5a5a5a", "\" لا إله إلا الله الواحد القهار، ربُّ السموات والأرض وما بينهما العزيز الغفار \"[1].\n" +
                "\n" +
                " يقول ذلك إذا تقلب من جنب إلى جنب في الليل ." + "\n" + " أخرجه الحاكم وصححه ووفقه الذهبي 1/ 540 والنسائي في اليوم والليلة وابن السني وانظر صحيح الجامع 4/213"));
        HomeRv_item_0.add(new Model("دعاء القلق والفزع في النوم", "#5a5a5a", "\" أعوذ بكلمات الله التَّامَّة من غضبه وعقابه، وشر عباده، ومن همزات الشياطين وأنْ يحضرون \"[1].\n" +
                "\n" +
                "1- أبو داود 4/12 نظر صحيح الترمذي3/ 171"));
        HomeRv_item_0.add(new Model("مايفعل من راي الرؤيا او الحلم", "#5a5a5a", "\" ينفث عن يساره \" (ثلاثاً)[1].\n" +
                "\n" +
                "         \" يستعيذ بالله من الشيطان ومن شر ما رأى \" (ثلاث مرات)[2].\n" +
                "\n" +
                "         \" لا يحدث بها أحدا ً \"[3].\n" +
                "\n" +
                "         \" يتحول عن جنبه الذي كان عليه \"[4].\n" +
                "\n" +
                "115- \" يقوم يصلي إن أراد ذلك \"[5].\n" +
                "\n" +
                "1- مسلم4/1772\n" +
                "2- مسلم4/1772- 1773\n" +
                "3- مسلم4/1772\n" +
                "4- مسلم4/1773\n" +
                "5- مسلم4/1773"));
        HomeRv_item_0.add(new Model("دعاء قنوت الوتر", "#5a5a5a", "116- \" اللهم اهدني فيمن هديت ، وعافني فيمن عافيت ، وتولني فيمن توليت ، وبارك لي فيما أعطيت ، وقني شر ما قضيت ، فإنك تقضي ولا يقضى عليك ، إنه لا يذل من واليت ،[ ولا يعز من عاديت ] تباركت ربنا وتعاليت \"[1]\n" +
                "\n" +
                "117- \" اللهم إني أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك ، وأعوذ بك منك لا أحصي ثناء عليك ، أنت كما أثنيت على نفسك \"[2]\n" +
                "\n" +
                "118- \" اللهم إياك نعبد ، ولك نُصلي ونسجد ، وإليك نسعى ونحفدُ ، نرجُو رحمتك ، ونخشى عذابك ، إن عذابك بالكافرين ملحق ، اللهم إنا نستعينك ، ونستغفرك ، ونثني عليك الخير ، ولا نكفرك ، ونؤمن بك ونخضع لك ، ونخلع من يكفرك \"[3].\n" +
                "\n" +
                "1- أخرجه أصحاب السنن الأربعة وأحمد والدرامي والحاكم والبيهقي وما بين المعكوفين للبيهقي وانظر صحيح الترمذي 1/144وصحيح ابن ماجه 1/194 وإرواء الغليل للألباني 2/172\n" +
                "\n" +
                "2- أخرجه أصحاب السنن الأربعة وأحمد. انظر صحيح الترمذي 3/180وصحيح ابن ماجه 1/194 والإرواء 2/175\n" +
                "\n" +
                "3- أخرجه البيهقي في السنن الكبرى وصحح إسناده 2/211 وقال الشيخ الألباني في إرواء الغليل وهذا إسناد صحيح 2/170 .وهو موقوف على عمر . "));
        HomeRv_item_0.add(new Model("الذكر عقب السلام من الوتر", "#5a5a5a", "كان رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يقرأ في الوتر :( سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى ) و ( وَقُلْ يَا أَيُّهَا الْكَافِرُونَ ) و ( وَقُلْ هُوَ اللَّهُ أَحَدٌ). فإذا سلم قال \" سبحان الملك القدوس [رب الملائكة والروح ]  \" ثلاث مرات والثالثة يجهر بها ويمد بها صوته \"[1].\n" +
                "\n" +
                "1- رواه النسائي 3/244 والدار قطني وغيرهما وما بين المعكوفين زيادة للدار قطني 2/31 وإسناده صحيح .انظر زاد المعاد بتحقيق شعيب الأرناؤوط وعبد القادر الأرناؤوط 1/337"));
        HomeRv_item_0.add(new Model("دعاء الكرب", "#5a5a5a", "122- \" لا إله إلا الله العظيم الحليم ، لا إله إلا الله رب العرش العظيم ، لا إله إلا الله رب السموات ورب العرش الكريم \"[1] .\n" +
                "\n" +
                "123- \" اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين ِ وأصلح لي شأني كله لا إله إلا أنت \"[2].\n" +
                "\n" +
                "124- \" لا إله إلا أنت سبحانك إني كنت من الظالمين \"[3]\n" +
                "\n" +
                "125- \" الله الله ربي لا أشرك به شيئاً \"[4] \n" +
                "\n" +
                "1- البخاري 7/154ومسلم 4/ 2092\n" +
                "\n" +
                "2- أبو داود 4/324 وأحمد 5/42 وحسنه الألباني في صحيح أبو داود 3/ 959\n" +
                "\n" +
                "3- الترمذي 5/529 والحاكم وصححه ووفقه الذهبي 1/505 وانظر صحيح الترمذي3/ 168\n" +
                "\n" +
                "4- أخرجه أبو داود 2/87 وانظر صحيح ابن ماجه 2/335"));
        HomeRv_item_0.add(new Model("دعاء الهم والحزن", "#5a5a5a", "\" اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك،ماضِ في حكمك ، عدل في قضاؤك ،أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري ،وجلاء حزني وذهاب همي \"[1]\n" +
                "\n" +
                "121- \" اللهم إني أعوذ بك من الهم والحزن ، والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال \"[2].\n" +
                "\n" +
                "1- أحمد 1/391وصححه الألباني\n" +
                "\n" +
                "2- البخاري 7/158 كان رسول الله صلى الله عليه وسلم يكثر من هذا الدعاء."));
        HomeRv_item_0.add(new Model("دعاء من اصابة شك في الايمان", "#5a5a5a", "133- \"يستعيذ بالله \" [1]\n" +
                "\n" +
                "         \"ينتهي عما شك فيه \"[2]\n" +
                "\n" +
                "134- يقول\" آمنت بالله ورسله \"[3]\n" +
                "\n" +
                "135- يقرأ قوله تعالى{ هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ }\"[4]\n" +
                "\n" +
                "1- البخاري مع الفتح 6/336 ومسلم 1/120\n" +
                "\n" +
                "2- البخاري مع الفتح 6/336 ومسلم 1/120\n" +
                "\n" +
                "3-  مسلم 1/  119- 120\n" +
                "\n" +
                "4- سورة الحديد ، الآية :3 .أبو داود 4/329 وحسنه الألباني في صحيح أبو داود 3/962"));
        HomeRv_item_0.add(new Model("الدعاء قضاء الدين", "#5a5a5a", "136- \" اللهم اكفني بحلالك عن حرامك ، وأغنني بفضلك عمن سواك \"[1]\n" +
                "\n" +
                "137- \" اللهم إني أعوذ بك من الهم والحزن ، والعجز والكسل ،والبخل والجبن وضلع الدين وغلبة الرجال\"[2].\n" +
                "\n" +
                "1- الترمذي 5/560 وانظر صحيح الترمذي3/ 180\n" +
                "\n" +
                "2-  البخاري7/ 158"));
        HomeRv_item_0.add(new Model("دعاء الوسوسة في الصلاة والقراءة", "#5a5a5a", "138- \" أعوذ بالله من الشيطان الرجيم واتفل على يسارك ( ثلاثاً )[1]\n" +
                "\n" +
                "1- مسلم 4/1729 من حديث عثمان بن العاص رضي الله عنه وفيه ففعلت ذلك فأذهبه الله عني"));
        HomeRv_item_0.add(new Model("دعاء من استصعب عليه امر", "#5a5a5a", "139- \" اللهم لا سهل إلا ما جعلته سهلاً وأنت تجعل الحزن إذا شئت سهلاً \"[1].\n" +
                "\n" +
                "1- رواة ابن حبان في صحيحه برقم 2427 (موارد) وابن السني برقم 351 وقال الحافظ هذا حديث صحيح وصححه عبد القادر الأرناؤوط في تخريج الأذكار للنووي ص106"));
        HomeRv_item_0.add(new Model("مايقول وما يفعل من أذنب ذنبا", "#5a5a5a", "140- \" ما من عبدٍ يذنب ذنباً فيحسن الطهور ، ثم يقوم فيصلي ركعتين ، ثم يستغفر الله إلا غفر الله لهُ \" [1]\n" +
                "\n" +
                "1- أبو داود 2/86 والترمذي 2/257 وصححه الألباني في صحيح أبي داود 1/ 283"));
        HomeRv_item_0.add(new Model("دعاء طرد الشيطان ووساوسه", "#5a5a5a", "141- \" الاستعاذة بالله منه \"[1]\n" +
                "\n" +
                "142- \" الأذان \" [2]\n" +
                "\n" +
                "143- \" الأذكار وقراءة القرآن \" [3]\n" +
                "\n" +
                "1- أبو داود 1/206 والترمذي وانظر صحيح الترمذي 1/77 وانظر سورة المؤمنون آية 98-99\n" +
                "\n" +
                "2- مسلم 1/ 291 والبخاري 1/151\n" +
                "\n" +
                "3- \" لاتجعلوا بيوتكم مقابر إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة \" رواه مسلم 1/539 ومما يطرد الشيطان أذكار الصباح والمساء ، والنوم والاستيقاظ ، وأذكار دخول المنزل والخروج منه وأذكار دخول المسجد والخروج منه وغير ذلك من الأذكار المشروعة مثل قراءة آية الكرسي عند النوم ، والآيتين الأخيرتين من سورة  البقرة ، ومن قال لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير مائة مرة كانت له حرزاً من الشيطان يومه كله ،وكذا الأذان يطرد الشيطان"));
        HomeRv_item_0.add(new Model("الدعاء حينما يقع مالا يرضاه أو غلب علي أمره", "#5a5a5a", "144- \" قدر الله وما شاء فعل \"[1]\n" +
                "\n" +
                "         إذا غلبك أمر فقل : \" حسبي الله ونعم الوكيل \"[2]\n" +
                "1- \" المؤمن القوي خير وأحب إلى الله من المؤمن الضعف وفي كل خير ،احرص على ما ينفعك واستعن بالله ولا تعجز وإن أصابك شيء فلا تقل لو أني فعلت كذا وكذا ولكن قل قدر الله وما شاء فعل فإن لو تفتح عمل الشيطان \" .مسلم 4/2052.\n" +
                "\n" +
                "2- انظر تخريج الأذكار للأرناؤوط ص 106."));
        HomeRv_item_0.add(new Model("تهنئة المولود له وجوابه", "#5a5a5a", "145- \" بارك الله لك في الموهوب لك ،وشكرت الواهب، وبلغ أشدهُ، ورزقت برهُ \" .ويردُ عليه المهنأ فيقول : \" بارك الله لك وبارك عليك ، وجزاك الله خيراً ، ورزقك الله مثله، وأجزل ثوابك \"[1] .\n" +
                "\n" +
                "1- انظر الأذكار للنووي ص349 وصحيح الأذكار للنووي ، لسليم الهلالي 2/713."));
        HomeRv_item_0.add(new Model("الدعاء للمريض", "#5a5a5a", "147- \" لا بأس طهور إن شاء الله \"[1] .\n" +
                "\n" +
                "148- \" أسأل الله العظيم رب العرش العظيم أن يشفيك\" (سبع مرات)[2]\n" +
                "\n" +
                "1- البخاري مع الفتح 10/ 118\n" +
                "\n" +
                "2- ما من عبد مسلم يعود مريضاً لم يحضر أجله فيقول: سبع مرات.....\"الحديث إلا عوفي . أخرجه الترمذي وأبو داود وانظر صحيح الترمذي2/ 210 وصحيح الجامع 5/180"));
        HomeRv_item_0.add(new Model("ما يعوذ به الأولاد", "#5a5a5a", "146- كان رسول الله صلى الله عليه وسلم يعوذ الحسن والحسين \" أعيذكما بكلمات الله التامة ، من كل شيطان وهامة ، ومن كل عينِ لامة \"[1].\n" +
                "\n" +
                "1- البخاري 4/119 من حديث ابن عباس رضي الله عنهما"));
        HomeRv_item_0.add(new Model("فضل عيادة المريض", "#5a5a5a", "149- قال صلى الله عليه وسلم :\" إذا عاد الرجل أخاه المسلم مشى في خرافة الجنة حتى يجلس فإذا جلس غمرته الرحمة ، فإن كان غدوة صلى عليه سبعون ألف ملك حتى يمسي ، وإن كان مساء صلى عليه سبعون ألف ملك حتى يصبح \"[1]\n" +
                "\n" +
                "1- رواه الترمذي وابن ماجه وأحمد وانظر صحيح ابن ماجه 1/244 وصحيح الترمذي 1/286 وصححه أيضاً أحمد شاكر"));
        HomeRv_item_0.add(new Model("دعاء المريض الذي يئس من حياته", "#5a5a5a", "150- \" اللهم اغفر لي وارحمني والحقني بالرفيق الأعلى\"[1]\n" +
                "\n" +
                "151- \" جعل النبي صلى الله عليه وسلم يدخل يديه في الماء فيمسح بهما وجههُ ويقول : لا إله إلا الله إن للموت لسكرات\" [2]\n" +
                "\n" +
                "152- \" لا إله إلا الله والله أكبر ، لا إله إلا الله وحده ، لا إله إلا الله وحده لا شريك لهُ ، لا إله إلا الله لهُ الملك ولهُ الحمد ، لا إله إلا الله ولا حول ولا قوة إلا بالله\"[3] .\n" +
                "\n" +
                "1- البخاري 7/10 ومسلم 4/1893\n" +
                "\n" +
                "2- البخاري مع الفتح 8/144وفي الحديث السواك\n" +
                "\n" +
                "3- أخرجه الترمذي وابن ماجه وصححه الألباني ، وانظر صحيح الترمذي 3/152وصحيح ابن ماجه 2/317"));
        HomeRv_item_0.add(new Model("تلقين المحتضر", "#5a5a5a", "153- \" من كان آخر كلامه لا إله إلا الله دخل الجنة \"[1]\n" +
                "\n" +
                "1- أبو داود 3/190 وانظر صحيح الجامع 5/432"));
        HomeRv_item_0.add(new Model("دعاء من أصيب بمصيبة", "#5a5a5a", "154- \" إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي وأخلف لي خيراً منها \"[1]\n" +
                "\n" +
                "1- مسلم 2/632"));
        HomeRv_item_0.add(new Model(" الدعاء عند إغماض الميت", "#5a5a5a", "155- \" اللهم اغفر  لفلان ( باسمه) ورفع درجته في المهديين، واخلفه في عقبه في الغابرين، واغفر لنا وله يا رب العالمين ،وافسح له في قبره ونور له فيه\"[1]\n" +
                "\n" +
                "1-  مسلم 2/634"));
        HomeRv_item_0.add(new Model(" دعاء التعزية", "#5a5a5a", "162- \" إن لله ما أخذ وله ما أعطى . وكل شيء عنده بأجل مُسمى ...فلتصبر ولتحتسب \"[1]\n" +
                "\n" +
                "وإن قال : \" أعظم الله أجرك ،وأحسن عزاءك وغفر لميتك \" فحسن [2]\n" +
                "\n" +
                "1- البخاري 2/80 ومسلم 2/636\n" +
                "\n" +
                "2- الأذكار للنووي ص126 ."));
        HomeRv_item_0.add(new Model("دعاء عند إدخال الميت القبر", "#5a5a5a", "163- \" بسم الله وعلى سُنة رسول الله \"[1]\n" +
                "\n" +
                "1- أبو داود 3/314بسند صحيح وأحمد بلفظ بسم الله وعلى ملة رسول الله وسنده صحيح ."));
        HomeRv_item_0.add(new Model("دعاء بعد دفن الميت", "#5a5a5a", "164- \" اللهم اغفر له اللهم ثبته \n" +
                "\n" +
                "1- كان النبي صلى الله عليه وسلم إذا فرغ من دفن الميت وقف عليه فقال :\" استغفروا لأخيكم وسلوا له التثبيت فإنه الآن يُسأل\" .أبو داود 3/315 والحاكم وصححه ووافقه الذهبي 1/370"));
        HomeRv_item_0.add(new Model("دعاء زيارة القبور", "#5a5a5a", "165- \" السلام عليكم أهل الديار ، من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون [ ويرحم الله المُستقدمين منا والمستأخرين ] أسأل الله لنا ولكم العافية [1]\n" +
                "\n" +
                "1- سلمم2/671 ،وابن ماجه واللفظ له 1/494 عن بريدة رضي الله عنه ، وما بين المعكوفين من حديث عائشة رضي الله عنها عند مسلم 2/671"));
        HomeRv_item_0.add(new Model("دعاء الريح", "#5a5a5a", "166- \" اللهم إني أسألك خيرها ، وأعوذ بك من شرها \"[1].\n" +
                "\n" +
                "167- \" اللهم إني أسألك خيرها ، وخير ما فيها ، وخير ما أُرسلت به ، وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به \"[2].\n" +
                "\n" +
                "1- أخرجه أبو داود 4/326وابن ماجه 2/1228 وانظر  صحيح ابن ماجة2/ 305\n" +
                "\n" +
                "2- مسلم 2/616 والبخاري 4/76."));
        HomeRv_item_0.add(new Model("دعاء الرعد", "#5a5a5a", "168- \" سبحان الذي يُسبح الرعد بحمده والملائكة من خيفته \"[1]\n" +
                "\n" +
                "1- كان عبد الله بن الزبير رضي الله عنهما إذا سمع الرعد ترك الحديث وقال :....\" الموطأ 2/992 وقال الألباني صحيح الإسناد موقوفاً "));
        HomeRv_item_0.add(new Model("من أدعية الاستسقاء", "#5a5a5a", "169- \" اللهم اسقنا غيثاً مغيثاً مريئاً مَريعاً نافعاً غير ضار ، عاجلاً غير آجل \"[1]\n" +
                "\n" +
                "170- \" اللهم أغثنا ، اللهم أغثنا ، اللهم أغثنا \"[2].\n" +
                "\n" +
                "171- \" اللهم اسق عبادك وبهائمك ، وانشر رحمتك وأحيي بلدك الميت\"[3]\n" +
                "\n" +
                "1- أبو داود 1/303 وصححه الألباني في صحيح أبي داود1/ 216\n" +
                "\n" +
                "2- والبخاري 1/224 ،مسلم 2/613\n" +
                "\n" +
                "3- أبو داود 1/305 وحسنه الألباني في صحيح أبي داود1/ 218"));
        HomeRv_item_0.add(new Model("الدعاء إذا نزل المطر", "#5a5a5a", "172- \" اللهم صيباً نافعاً \"[1].\n" +
                "\n" +
                "1- البخاري مع الفتح 2/518"));
        HomeRv_item_0.add(new Model("الذكر بعد نزول المطر", "#5a5a5a", "173- \" مُطرنا بفضل الله ورحمته \"[1]\n" +
                "\n" +
                "1- والبخاري 1/205 ،مسلم 1/83"));
        HomeRv_item_0.add(new Model("من أدعية الاستصحاء", "#5a5a5a", "174- \" اللهم حوالينا ولا علينا ، اللهم على الآكامِ والظرابِ وبُطون الأودية ، ومنابت الشجر \"[1]\n" +
                "\n" +
                "1- والبخاري 1/224 ،مسلم 2/614"));
        HomeRv_item_0.add(new Model("دعاء رؤية الهلال", "#5a5a5a", "175- \" الله أكبر ،اللهم أهلِه علينا بالأمن والإيمان ، والسلامة والإسلام ،والتوفيق لما تحب ربنا وترضى ، ربنا وربك الله \"[1]\n" +
                "\n" +
                "1- الترمذي 5/504 والدارمي بلفظه 1/336 وانظر صحيح الترمذي3/ 157"));
        HomeRv_item_0.add(new Model("الدعاء عند إفطار الصائم", "#5a5a5a", "176- \" ذَهبَ الظَّمأُ، وابتلَّت العروقُ وثَبَتَ الأجرُ إنْ شاء الله\"[1].\n" +
                "\n" +
                "177- \" اللهم إني أسألك برحمتك التي وسعت كل شيءٍ أن تغفر لي \" [2]\n" +
                "\n" +
                "1- أخرجه أبي داود 2/306 وغيره وانظر صحيح الجامع 4/209\n" +
                "\n" +
                "2- أخرجه ابن ماجه 1/557 من دعاء عبد الله بن عمرو رضي الله عنهما ،وحسنه الحافظ في تخريج الأذكار انظر شرح الأذكار 4/342"));
        HomeRv_item_0.add(new Model("الدعاء قبل الطعام", "#5a5a5a", "178- \" إذا أكل أحدكم الطعام فليقل: \"بِسم الله، فإن نسي في أوله فليقل: بِسمِ الله في أوله وآخره\"[1].\n" +
                "\n" +
                "179- \" من أطعمه الله الطعام فليقل: اللهم بارك لنا فيه وأطعمنا خيراً منه\". ومن سقاه الله لبناً فليقل: اللهم بارك لنا فيه وزدنا منه\"[2].\n" +
                "\n" +
                "1- أخرجه أبو داود 3/347 والترمذي 4/288 وانظر صحيح الترمذي2/ 167\n" +
                "\n" +
                "2- الترمذي 5/506 وانظر صحيح الترمذي3/ 158"));
        HomeRv_item_0.add(new Model("الدعاء عند الفراغ من الطعام", "#5a5a5a", "180- \" الحمد لله الذي أطعمني هذا ،وزرقنيه ،من غير حول مني ولا قوة\"[1]\n" +
                "\n" +
                "181- \" الحمدُ لله حمداً كثيراً طيباً مباركاً فيهِ، غيْرَ [مَكْفيٍّ ولا] مُوَدَّع، ولا مُستَغنَى عَنْهُ ربّنا\"[2].\n" +
                "\n" +
                "1- أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 3/159\n" +
                "\n" +
                "2- البخاري 6/\u200C214 والترمذي بلفظه 5/ 507"));
        HomeRv_item_0.add(new Model("دعاء الضيف لصاحب الطعام", "#5a5a5a", "182- \" اللهُمَّ بَارِكْ لَهُم فيما رَزَقتهْمْ، واغْفِر لهم وارحَمْهُم \"[1].\n" +
                "\n" +
                "1- مسلم3/ 1626"));
        HomeRv_item_0.add(new Model("الدعاء لمن سقاه أو إذا أراد ذلك", "#5a5a5a", "183- \" اللهُمَّ أَطْعِمْ مَنْ أطْعَمَني وأَسْقِ مَنْ سْقَاني \"[1].\n" +
                "\n" +
                "1- مسلم3/ 26"));
        HomeRv_item_0.add(new Model("الدعاء إذا أفطر عند أهل بيت", "#5a5a5a", "184- \" أَفطَر عِنْدَكُم الصائِمونَ ، وأكل طعامَكُمُ الأبْرارُ ، وصلت عليكُمُ الملائِكَةُ \"[1].\n" +
                "\n" +
                "1- سنن أبي داود 3/367، وابن ماجه 1/556 ،والنسائي في عمل اليوم والليلة برقم 296- 298 ،ونص على أنه صلى الله عليه وسلم يقوله إذا أفطر عند أهل بيت ،وصححه الألباني في صحيح أبي داود 2/730"));
        HomeRv_item_0.add(new Model("دعاء الصائم إذا حضر الطعام ولم يفطر", "#5a5a5a", "185- \" إذا دُعي أحدكم فليجب ، فإن كان صائماً فليصل وإن كان مفطراً فليطعم \"[1] ومعنى فليصل أي فليدع .\n" +
                "\n" +
                "1- مسلم 2/1054"));
        HomeRv_item_0.add(new Model("ما يقول الصائم إذا سابه أحد", "#5a5a5a", "186- \" إني صائم ، إني صائم \"[1].\n" +
                "\n" +
                "1- البخاري مع الفتح 4/103 ،ومسلم 2/ 806"));
        HomeRv_item_0.add(new Model("الدعاء عند رؤية باكورة الثمر", "#5a5a5a", "187- \" اللهم بارك لنا في ثمرنا ، وبارك لنا في مدينتنا وبارك لنا في صاعنا ، وبارك لنا في مدنا \"[1]\n" +
                "\n" +
                "1- مسلم 2/1000"));
        HomeRv_item_0.add(new Model("دعاء العطاس", "#5a5a5a", "188- \" إذا عطس أحدكم فليقل الحمد لله ،وليقل له أخوهُ أو صاحبهُ : يرحمك الله ،فإذا قال لهُ :يرحمك الله ،فليقل :يهديكم الله ويصلح بالكم \" [1]\n" +
                "\n" +
                "1- البخاري 7/125"));
        HomeRv_item_0.add(new Model("ما يقالُ للكافر إذا عطس فحمد الله", "#5a5a5a", "189- \" يهديكم الله ويصلح بالكم \" [1]\n" +
                "\n" +
                "1- الترمذي 5/82 وأحمد 4/400 وأبو داود 4/308، وانظر صحيح الترمذي 2/354"));
        HomeRv_item_0.add(new Model("الدعاء للمتزوج", "#5a5a5a", "190- \" بارك الله لك ، وبارك عليك ، وجمع بينكما في خير \"[1] .\n" +
                "\n" +
                "1- أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 1/316"));
        HomeRv_item_0.add(new Model("دعاء المتزوج لنفسه ودعاء شراء الدابة", "#5a5a5a", "191- إذا تزوج أحدكم امرأة ،أو إذا اشترى خادماً فليقل :\" اللهم إني أسألك خيرها وخير ما جبلتها عليه وأعوذ بك من شرها وشر ما جبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك \"[1]\n" +
                "\n" +
                "1- أبو داود 2/248 وابن ماجه 1/617 وانظر صحيح ابن ماجه 1/324"));
        HomeRv_item_0.add(new Model("الدعاء قبل إتيان الزوجة", "#5a5a5a", "192- \" بسم الله ، اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا \"[1]\n" +
                "\n" +
                "1- البخاري 6/141 ومسلم 2/1028"));
        HomeRv_item_0.add(new Model("دعاء الغضب", "#5a5a5a", "193- \" أعوذ بالله من الشيطان الرجيم \"[1]\n" +
                "\n" +
                "1- البخاري 6/99 ومسلم4/2015"));
        HomeRv_item_0.add(new Model("دعاء من رأى مبتلى", "#5a5a5a", "194- \" الحمد لله الذي عافاني مما ابتلاك به ، وفضلني على كثير ممن خلق تفضيلاً \"[1]\n" +
                "\n" +
                "1- الترمذي 5/494 و5/493 وانظر  صحيح الترمذي3/ 153"));
        HomeRv_item_0.add(new Model("ما يقال في المجلس", "#5a5a5a", "195- عن ابن عمر قال : كان يعد لرسول الله صلى الله عليه وسلم في المجلس الواحد مائة مرة من قبل أن يقوم \"رب اغفر لي وتب علي إنك أنت التواب الغفور \"[1]\n" +
                "\n" +
                "1- الترمذي وغيره وانظر صحيح الترمذي 3/153 وصحيح ابن ماجه 2/321 ولفظه للترمذي"));
        HomeRv_item_0.add(new Model("كفارة المجلس", "#5a5a5a", "196- \" سبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك \"[1].\n" +
                "\n" +
                "1- أخرجه أصحاب السنن وانظر صحيح الترمذي 3/153، وقد ثبت عن عائشة رضي الله عنها قالت :ما جلس رسول الله صلى الله عليه وسلم مجلساً ، ولاتلى قرآناً ، ولا صلاة إلا ختم ذلك بكلمات....\" الحديث أخرجه النسائي في عمل اليوم والليلة برقم 308 ، وأحمد 6/77 وصححه الدكتور فاروق حمادة في تحقيقه لعمل اليوم والليلة للنسائي ص273"));
        HomeRv_item_0.add(new Model("مايختم به جميع المجالس", "#5a5a5a", "عن عائشة رضي الله عنها قالت : ماجلس رسول الله صلى الله عليه وسلم مجلساً قط ، ولا تلا قرآناً ، ولا صلى صلاة إلا ختم ذلك بكلمات قالت : فقلت : يارسول الله أراك ما تجلس ( مجلساً ) ولا تتلو قرآنا ، ولا تصلي صلاة إلا ختمت بهؤلاء الكلمات ؟ قال : نعم ( من قال خيراً خُتم له طابع على ذلك الخير ، ومن قال شراً كن له كفارة ) ، (( سبحانك وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك ))."));
        HomeRv_item_0.add(new Model("الدعاء لمن قال غفر الله لك", "#5a5a5a", "197- \" ولك \"[1]\n" +
                "\n" +
                "1- أحمد 5/28 والنسائي في عمل اليوم والليلة ص218برقم 421 تحقيق الدكتور فاروق حمادة"));
        HomeRv_item_0.add(new Model("الدعاء لمن صنع إليك معروفاً", "#5a5a5a", "198- \" جَزَاكَ الله خيراً \"[1].\n" +
                "\n" +
                "1- أخرجه الترمذي رقم 2035 وانظر صحيح الجامع 6244 وصحيح الترمذي2/ 200"));
        HomeRv_item_0.add(new Model("ما يعصم به من الدجال", "#5a5a5a", "199- \" من حفظ عشر آيات من أول سورة الكهف عصم من الدجال \"[1] والاستعاذة بالله من فتنتة عقب التشهد الأخير من كل صلاة .[2]\n" +
                "\n" +
                "1- مسلم 1/555 وفي رواية من آخر الكهف 1/556\n" +
                "\n" +
                "2- انظر حديث رقم 55 وحديث 56"));
        HomeRv_item_0.add(new Model("الدعاء لمن قال إني أحبك في الله", "#5a5a5a", "200- \" أحبك الذي أحببتني له ُ\"[1]\n" +
                "\n" +
                "1- أخرجه أبو داود 4/333، وحسنه الألباني في صحيح سنن أبي داود 3/965"));
        HomeRv_item_0.add(new Model("الدعاء لمن عرض عليك ماله", "#5a5a5a", "201- \" بارك الله لك في أهلك ومالك \". [1]\n" +
                "\n" +
                "1- البخاري الفتح4/ 88"));
        HomeRv_item_0.add(new Model("الدعاء لمن أقرض عند القضاء", "#5a5a5a", "202- \" بارك الله لك في أهلك ومالك إنما جزاء السلف الحمد والأداء \"[1]\n" +
                "\n" +
                "1- أخرجه النسائي في عمل اليوم والليلة ص 300 وابن ماجه 2/ 809 وانظر صحيح ابن ماجه 2/809 وانظر صحيح ابن ماجه 2/55"));
        HomeRv_item_0.add(new Model("دعاء الخوف من الشرك", "#5a5a5a", "203- \" اللهم إني أعوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم \" [1]\n" +
                "\n" +
                "1- أحمد 4/403 وغيره وانظر صحيح الجامع 3/333 وصحيح الترغيب والترهيب للألباني"));
        HomeRv_item_0.add(new Model("الدعاء لمن قال بارك الله فيك", "#5a5a5a", "204- \" وفيك بارك الله \"[1]\n" +
                "\n" +
                "1- أخرجه ابن السني ص138 برقم 278 وانظر الوابل الصيب لابن القيم 304 تحقيق بشير محمد عيون"));
        HomeRv_item_0.add(new Model("دعاء كراهية الطيرة", "#5a5a5a", "205- \" اللهم لا طير إلا طيرك ، ولا خير إلا خيرك ،ولا إله غيرك \"[1]\n" +
                "\n" +
                "1- أحمد 2/220 وابن السني برقم 292 وصححه الألباني في الأحاديث الصحيحة 3/54 رقم 1065 ، أما الفأل فكان يعجب النبي صلى الله عليه وسلم ؛ ولهذا سمع من رجل كلمة طيبة فأعجبته فقال : \"أخذنا فألك من فيك \" أبو داود وأحمد ،وصححه الألباني في الصحيحة2/363 عند أبي الشيخ في أخلاق النبي"));
        HomeRv_item_0.add(new Model("دعاء ركوب الدابة", "#5a5a5a", "206- \" بسم الله. الحمد لله. {سُبْحانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ} الحمد لله ، الحمد لله ، الحمد لله ، الله اكبر ، الله اكبر ، الله اكبر ، سبحانك اللهم إني ظلمت نفسي فاغفر لي ، فإنه لا يغفر الذنوب إلا أنت \"[1].\n" +
                "\n" +
                "1- أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 156"));
        HomeRv_item_0.add(new Model("دعاء السفر", "#5a5a5a", "207- \"الله أكبر، الله أكبر، الله أكبر،{سُبْحانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ}  \"اللهم إنا نسألُكَ في سفرنا هذا البرَّ والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا واطو عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعْثاءِ السفر، وكآبة المنظر وسوء المنقلب في المال والأهل\" وإذا رجع قالهن وزاد فيهن \"آيبون، تائبون، عابدون، لربنا حامدون\"[1].\n" +
                "\n" +
                "1- رواه مسلم2/ 978"));
        HomeRv_item_0.add(new Model("دعاء دخول القرية أو البلدة", "#5a5a5a", "208- \" اللهم رب السموات السبع وما أظللن ، ورب الأرضين السبع وما أقللن ،ورب الشياطين وما أضللن ، ورب الرياح وما ذرين.أسألك خير هذه القرية وخير أهلها ، وخير ما فيها،وأعوذ بك من شرها،وشر أهلها ، وشر ما فيها\"[1]\n" +
                "\n" +
                "1- الحاكم وصححه ووافقه الذهبي 2/100 وابن السني برقم 524وحسنه الحافظ في تخريج الأذكار 5/154 قال ابن باز:ورواه النسائي بإسناد حسن . انظر تحفة الأخيار ص 37"));
        HomeRv_item_0.add(new Model("دعاء دخول السوق", "#5a5a5a", "209- \" لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد ، يُحيي ويُميت ، وهو حي لا يموت ، بيده الخير وهو على كل شئ قدير \"[1].\n" +
                "\n" +
                "1- الترمذي 5/491 والحاكم 1/538 وحسنه الألباني في صحيح ابن ماجه 2/21 وفي صحيح الترمذي3/ 152"));
        HomeRv_item_0.add(new Model("الدعاء إذا تعس المركوب", "#5a5a5a", "210- \" بسم الله \" [1]\n" +
                "\n" +
                "1- أبو داود 4/296 وصححه الألباني في صحيح أبي داود 3/941"));
        HomeRv_item_0.add(new Model("دعاء المسافر للمقيم", "#5a5a5a", "211- \" أستودعُكَ الله الذي لا تضيع ودائعه \"[1].\n" +
                "\n" +
                "1- أحمد 2/403 وابن ماجه 2/943 وانظر صحيح ابن ماجة2/ 133"));
        HomeRv_item_0.add(new Model("دعاء المقيم للمسافر", "#5a5a5a", "212- \" أستودع الله دينك وأمانتك ،وخواتيم عملك \"[1].\n" +
                "\n" +
                "213- \" زوَّدك الله التقوى، وغفر ذْنبك ويسَّر لك الخير حيث ما كنت \".[2]\n" +
                "\n" +
                "1- أحمد 2/7 الترمذي5/499  وانظر صحيح الترمذي3/ 155\n" +
                "\n" +
                "2- الترمذي وانظر صحيح الترمذي3/ 155"));
        HomeRv_item_0.add(new Model("التكبير والتسبيح في سير السفر", "#5a5a5a", "214- قال جابر رضي الله عنه : \" كنا إذا صعدنا كبرنا ، وإذا نزلنا سبحنا \"[1].\n" +
                "\n" +
                "1- البخاري الفتح6/ 135"));
        HomeRv_item_0.add(new Model("دعاء المسافر إذا أسحر", "#5a5a5a", "215- \" سَمعَ سَامعً بحمد الله وحُسنِ بلائه علينا، ربنا صاحبنا ، وأفضِل علينا عائذا بالله من النار\"[1].\n" +
                "\n" +
                "1- مسلم4/ 2086 ومعني سمع سامع : أي شهد شاهد على حمدنا لله تعالى على نعمه وحسن بلائه . ومعني سمع سامع : بلغ سامع قولي هذا لغيره وقال مثله تنبيهاً على الذكر في السحر والدعاء . وقوله : ربنا صاحبنا وأفضل علينا : أي احفظنا وحطنا واكلأنا وأفضل علينا بجزيل نعمك واصرف عنا كل مكروه ، شرح النووي 17/39"));
        HomeRv_item_0.add(new Model("الدعاء إذا نزل منزلا في سفر أو غيره", "#5a5a5a", "6- \" أعوذ بكلمات الله التامات من شر ما خلق \"[1]\n" +
                "\n" +
                "1- رواه مسلم4/2080"));
        HomeRv_item_0.add(new Model("ذكر الرجوع من السفر", "#5a5a5a", "217- \" يكبر على كل شرف ثلاث تكبيرات ثم يقول : لا إله إلا الله وحده لا شريك لهُ ،لهُ الملك ، ولهُ الحمدُ وهو على كل شيءٍ قدير ، آيبون ،تائبون ، عابدون ، لربنا حامدون ،صدق الله وعده،ونصر عبده،وهزم الأحزاب وحده\"[1]\n" +
                "\n" +
                "1- كان النبي صلى الله عليه وسلم يقوله إذا قفل من غزو أو حج ، البخاري 7/163 ومسلم 2/ 980"));
        HomeRv_item_0.add(new Model("ما يقول ويفعل من أتاه أمر يسره أو يكرهه", "#5a5a5a", "218- كان صلى الله عليه وسلم إذا أتاه الأمر يسره قال :\" الحمد لله الذي بنعمته تتم الصالحات \" و إذا أتاه أمر يكرهه قال : \" الحمد لله على كل حال \"[1]\n" +
                "\n" +
                "1- أخرجه ابن السني في عمل اليوم والليلة والحاكم وصححه 1/499 وصححه الألباني في صحيح الجامع 4/ 201"));
        HomeRv_item_0.add(new Model("فضل الصلاة على النبي صلى الله عليه وسلم", "#5a5a5a", "219- قال صلى الله عليه وسلم \" من صلى علي صلاة صلى الله عليه بها عشراً \" [1]\n" +
                "\n" +
                "220- وقال صلى الله عليه وسلم : \" لا تجعلوا قبري عيداً وصلوا علي ؛ فإن صلاتكم تبلغني حيث كنتم \" [2].\n" +
                "\n" +
                "221- وقال صلى الله عليه وسلم : \" البخيل من ذكرت عندهُ فلم يصل علي \"[3]\n" +
                "\n" +
                "222- وقال صلى الله عليه وسلم \" إن لله ملائكة سياحين في الأرض يبلغوني من أمتي السلام \"[4]\n" +
                "\n" +
                "223- وقال صلى الله عليه وسلم \" ما من أحدٍ يسلِّمُ عليَّ إلَّا ردَّ اللَّهُ عليَّ روحي حتَّى أردَّ عليْهِ السَّلامَ \"[5]\n" +
                "\n" +
                "1- أخرجه مسلم 1/288\n" +
                "\n" +
                "2- أبو داود 2/218 وأحمد 2/367 وصححه الألباني في صحيح أبي داود 2/ 383\n" +
                "\n" +
                "3- الترمذي 5/551 وغيره وانظر صحيح الجامع 3/ 25 وصحيح الترمذي 3/ 177\n" +
                "\n" +
                "4- النسائي ،والحاكم 2/421 وصححه الألباني في صحيح النسائي 1/274\n" +
                "\n" +
                "5- أبو داود برقم 2041وحسنه الألباني في صحيح أبي داود 1/ 383"));
        HomeRv_item_0.add(new Model("إفشاء السلام", "#5a5a5a", "224- قال رسول الله صلى الله عليه وسلم :\" لا تدخلوا الجنة حتى تؤمنوا ، ولا تؤمنوا حتى تحابوا ، أو لا أدلكم على شيءٍ إذا فعلتموه تحاببتم ، أفشوا السلام بينكم \"[1]\n" +
                "\n" +
                "225- ثلاث من جمعهن فقد جمع الإيمان : الإنصاف من نفسك ، وبذل السلام للعالم ،والإنفاق من الإقتار \" [2]\n" +
                "\n" +
                "226- وعن عبد الله بن عمر رضي الله عنهما : أن رجلاً سأل النبي صلى الله عليه وسلم أي الإسلام خير قال :\" تطعم الطعام وتقرأ السلام على من عرفت ومن لم تعرف \" [3]\n" +
                "\n" +
                "1- مسلم 1/74 وغيره\n" +
                "\n" +
                "2- البخاري مع الفتح 1/ 82 عن عمار رضي الله عنه موقوفاً معلقاً\n" +
                "\n" +
                "3- البخاري مع الفتح 1/55 ومسلم 1/65."));
        HomeRv_item_0.add(new Model("كيف يرد السلام على الكافر إذا سلم", "#5a5a5a", "227- إذا سلم عليكم أهل الكتاب فقولوا : \" وعليكم \"[1]\n" +
                "\n" +
                "1- البخاري مع الفتح11/42 ،ومسلم 4/1705"));
        HomeRv_item_0.add(new Model("دعاء صياح الديك ونهيق الحمار", "#5a5a5a", "228- \" إذا سمعتم صياح الديكة ، فاسألوا الله من فضله فإنها رأت ملكاً وإذا سمعتم نهيق الحمار ، فتعوذوا بالله من الشيطان فإنه رأى شيطاناً \"[1].\n" +
                "\n" +
                "1- البخاري مع الفتح6/350 ،ومسلم 4/2092"));
        HomeRv_item_0.add(new Model("دعاء نباح الكلاب بالليل", "#5a5a5a", "229- \" إذا سمعتم نُباح الكلاب ونهيق الحمير بالليل فتعوذوا بالله منهن فإنهن يرين ما لا ترون \"[1].\n" +
                "\n" +
                "1- أبو داود 4/ 327 وأحمد 3/ 306 وصححه الألباني في صحيح أبي داود3/ 961"));
        HomeRv_item_0.add(new Model("الدعاء لمن سببته", "#5a5a5a", "230- قال صلى الله عليه وسلم: \" اللَّهُم فأيما مؤمن سببته فاجعل ذلك له قربة إليك يوم القيامة \"[1].\n" +
                "\n" +
                "1- البخاري مع الفتح 11/ 171 و مسلم4/ 2007 ولفظه فاجعلها له زكاة ورحمة"));
        HomeRv_item_0.add(new Model("ما يقول المسلم إذا مدح المسلم", "#5a5a5a", "231- قال صلى الله عليه وسلم : \" إذا كان أحدكم مادحاً صاحبه لا محالة فليقل : أحسبُ فلاناً والله حسيبهُ ولا أزكي على الله أحداً ، أحسبهُ – إن كان يعلم ذاك – كذا وكذا \" [1]\n" +
                "\n" +
                "1- رواه مسلم 4/2296"));
        HomeRv_item_0.add(new Model("ما يقول المسلم إذا زكي", "#5a5a5a", "232- \" اللهم لا تؤاخذني بما يقولون ، واغفر لي مالا يعلمون [واجعلني خيراً مما يظنون]\"[1]\n" +
                "\n" +
                "1- البخاري في الأدب المفرد برقم 761 ، وصحح إسناده الألباني في صحيح الأدب المفرد برقم 585 ، وما بين المعكوفين زيادة للبيهقي في شعب الإيمان 4/ 228 من طريق آخر ."));
        HomeRv_item_0.add(new Model("كيف يلبي المحرم في الحج أو العمرة", "#5a5a5a", "233- \" لبيك اللهم لبيك ، لبيك لا شريك لك لبيك ، إن الحمد والنعمة لك والملك ، لا شريك لك \"[1]\n" +
                "\n" +
                "1- البخاري مع الفتح 3/ 408 ، ومسلم 2/841"));
        HomeRv_item_0.add(new Model("التكبيرة إذا أتي الركن الأسود", "#5a5a5a", "234- \" طاف النبي صلى الله عليه وسلم بالبيت على بعير كلما أتي الركن أشار إليه بشيء عنده وكبر \" [1]\n" +
                "\n" +
                "1- البخاري مع الفتح 3/476 ،والمراد بالشيء المحجن انظر : البخاري مع الفتح 3/472."));
        HomeRv_item_0.add(new Model("الدعاء بين الركن اليماني والحجر الأسود", "#5a5a5a", "235- { رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ}[1]\n" +
                "\n" +
                "1- أبو داود 2/ 179 وأحمد 3/411 والبغوي في شرح السنة 7/128 ،وحسنه الألباني في صحيح أبي داود 1/ 354 ، والآية من سورة البقرة ، 201"));
        HomeRv_item_0.add(new Model("دعاء الوقوف على الصفا والمروة", "#5a5a5a", "236- فلما دنا صلى الله عليه وسلم من الصفا قرأ: { إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَآئِرِ اللّهِ } \" أبدأ بما بدأ الله به \" فبدأ بالصفا فرقي عليه حتى رأى البيت فاستقبل القبلة ، فوحد الله وكبره وقال : \" لا إله إلا الله وحده لا شريك لهُ ، لهُ الملك ولهُ الحمد وهو على كل شيءٍ قدير ، لا إله إلا الله وحده ، أنجز وعده ، ونصر عبده ، وهزم الأحزاب وحده \" ثم دعا بين ذلك . قال مثل هذا ثلاث مرات \" الحديث وفيه \" ففعل على المروة كما فعل على الصفا \" [1]\n" +
                "\n" +
                "1- مسلم 2/888"));
        HomeRv_item_0.add(new Model("الدعاء يوم عرفة", "#5a5a5a", "237- \" خير الدعاء دعاء يوم عرفة ، وخيرُ ما قلت أنا والنبيُّون من قبلي : لا إله إلا الله وحدهُ لا شريك لهُ ، لهُ الملكُ ولهُ الحمدُ وهو على كل شيء قدير\" [1]\n" +
                "\n" +
                "1- الترمذي وحسنه الألباني في صحيح الترمذي 3/184، وفي الحديث الصحيحة 4/6"));
        HomeRv_item_0.add(new Model("الذكر عند المشعر الحرام", "#5a5a5a", "238- \" ركب صلى الله عليه وسلم القصواء حتى أتى المشعر الحرام فاستقبل القبلة ( فدعاه ُ، وكبرهُ ،وهللهُ ، ووحدهُ) فلم يزل واقفاً حتى أسفر جداً فدفع قبل أن تطلع الشمس \"[1]\n" +
                "\n" +
                "1- مسلم 2/891"));
        HomeRv_item_0.add(new Model("التكبيرة عند رمي الجمار مع كل حصاة", "#5a5a5a", "239- \"يكبر كلما رمى بحصاة عند الجمار الثلاث ثم يتقدم، ويقف يدعو مستقبل القبلة، رافعاً يديه بعد الجمرة الأولى والثانية، أما جمرة العقبة فيرميها ويكبر عند كل حصاة وينصرف ولا يقف عندها \"[1]\n" +
                "\n" +
                "1- البخاري مع الفتح 3/583 و3/584 وانظر لفظه هناك . والبخاري مع الفتح 3/581 ورواه مسلم أيضاً"));
        HomeRv_item_0.add(new Model("ما يقول عند التعجب والأمر السار", "#5a5a5a", "240- \" سبحان الله \"[1]\n" +
                "\n" +
                "241- \" الله أكبر \"[2]\n" +
                "\n" +
                "1- البخاري مع الفتح 1/210 و390 و414 ومسلم 4/ 1857.\n" +
                "\n" +
                "2- البخاري الفتح8/ 441 وانظر صحيح الترمذي 2/103 و2/235 ومسند أحمد 5/ 218"));
        HomeRv_item_0.add(new Model("ما يفعل من أتاه أمر يسره", "#5a5a5a", "242- \" كان النبي صلى الله عليه وسلم إذا أتاه أمر يسرهُ أو يسرُّ به خر ساجداً شكراً لله تبارك وتعالى \" [1]\n" +
                "\n" +
                "1- رواه أهل السنن إلا النسائي . انظر صحيح ابن ماجه 1/ 233 وإرواء الغليل 2/226"));
        HomeRv_item_0.add(new Model("ما يقول من أحس وجعاً في جسده", "#5a5a5a", "243- \" ضع يدك على الذي تألم من جسدك وقل: بسم الله ، ثلاثاً  وقل سبع مرات : \" أعوذ بالله وقدرته من شر ما أجد وأحاذر\" [1]\n" +
                "\n" +
                "1- مسلم 4/1728"));
        HomeRv_item_0.add(new Model("دعاء من خشي أن يصيب شيئاً بعينه", "#5a5a5a", "244- \" إذا رأى أحدكم من أخيه ، أو من نفسه ، أومن ماله ما يعجبهُ [فليدع لهُ بالبركة ] فإن العين حقٌّ \"[1]\n" +
                "\n" +
                "1- مسند أحمد 4/447 وابن ماجه ومالك ، وصححه الألباني في صحيح الجامع 1/212 وانظر تحقيق زاد المعاد للأرناؤوط 4/170"));
        HomeRv_item_0.add(new Model("ما يقال عند الفزع", "#5a5a5a", "245- \" لا إله إلا الله \"[1]\n" +
                "\n" +
                "1- البخاري مع الفتح 6/ 181 ، ومسلم 4/ 2208 ."));
        HomeRv_item_0.add(new Model("ما يقول عند الذبح أو النحر", "#5a5a5a", "246- \" بسم الله والله أكبر [ اللهم منك ولك ] اللهم تقبل مني \"[1].\n" +
                "\n" +
                "1- مسلم 3/1557 والبيهقي 9/287 وما بين المعكوفين للبيهقي 9/287 وغيره والجملة الأخيرة سقتها بالمعنى من رواية مسلم ."));
        HomeRv_item_0.add(new Model("ما يقول لرد كيد مردة الشياطين", "#5a5a5a", "247- \" أعوذ بكلمات الله التامات التي لا يجاوزهن بر ولا فاجر من شر ما خلق ، وبرأ وذرأ ومن شر ما ينزل من السماء ، ومن شر ما يعرج فيها ، ومن شر ما ذرأ في الأرض ، ومن شر ما يخرج منها ، ومن شر فتن الليل والنهار ، ومن شر كل طارق إلا طارقاً يطرق بخير يا رحمن \"[1]\n" +
                "\n" +
                "1- أحمد 3/419 بإسناد صحيح وابن السني برقم 637 وصحح إسناده الأرناؤوط في تخريجه للطحاوية ص 133 وانظر مجمع الزوائد 10/ 127."));
        HomeRv_item_0.add(new Model("الاستغفار والتوبة", "#5a5a5a", "248- قال رسول الله صلى الله عيه وسلم :\" والله إني لاستغفر الله وأتوب إليه في اليوم أكثر من سبعين مرة \"[1] .\n" +
                "\n" +
                "249- وقال صلى الله عيه وسلم :\" يا أيها الناس توبوا إلى الله فإني أتوب في اليوم إليه مائة مرةً \"[2]\n" +
                "\n" +
                "250- وقال صلى الله عيه وسلم :\" من قال أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه ، غفر الله لهُ وإن كان فر من الزحف \"[3]\n" +
                "\n" +
                "251- وقال صلى الله عيه وسلم :\" أقرب ما يكون الربُّ من العبد في جوف الليل الآخر فإن استطعت أن تكون ممن يذكر الله في تلك الساعة فكن \" [4]\n" +
                "\n" +
                "252- وقال صلى الله عيه وسلم :\" أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء \" [5]\n" +
                "\n" +
                "253- وقال صلى الله عيه وسلم :\" إنه ليغان على قلبي وإني لاستغفرُ الله في اليوم مائة مرة \"[6].\n" +
                "\n" +
                "1- البخاري مع الفتح 11/101\n" +
                "\n" +
                "2- مسلم 4/2076\n" +
                "\n" +
                "3- أخرجه أبو داود 2/85 والترمذي 5/569 والحاكم وصححه ووافقه الذهبي 1/511 وصححه الألباني . انظر صحيح الترمذي 3/182 وجامع الأصول لأحاديث الرسول صلى الله عيه وسلم 4/389 – 390 بتحقيق الأرناؤوط\n" +
                "\n" +
                "4- أخرجه الترمذي والنسائي 1/279 والحاكم وانظر صحيح الترمذي 3/183 وجامع الأصول بتحقيق الأرناؤوط 4/144\n" +
                "\n" +
                "5- مسلم 1/350 .\n" +
                "\n" +
                "6- أخرجه مسلم 4/2075 قال ابن الأثير : ( ليُغان على قلبي ) أي ليغطى ويغشى والمراد : السهو ؛ لأنه كان صلى الله عيه وسلم لا يزال في مزيد من الذكر والقربة ودوام المراقبة فإذا سها عن شيء منها في بعض الأوقات ،أو نسي ،عدهُ ذنباً على نفسه ففزع إلى الاستغفار . انظر جامع الأصول 4/386"));
        HomeRv_item_0.add(new Model("فضل التسبيح والتحميد ، والتهليل ، والتكبير", "#5a5a5a", "254- \" قال صلى الله عيه وسلم من قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه ولو كانت مثل زبد البحر[1]\n" +
                "\n" +
                "255- وقال صلى الله عيه وسلم :\" من قال لا إله إلا وحده لا شريك لهُ ، لهُ الملك ، ولهُ الحمدُ ، وهو على كل شيء قدير عشر مرات . كان كمن أعتق أربعة أنفس من ولد إسماعيل \"[2]\n" +
                "\n" +
                "256- وقال صلى الله عيه وسلم :\" كلمتان خفيفتان على اللسان ، ثقيلتان في الميزان حبيبتان إلى الرحمن : سبحان الله وبحمده سبحان الله العظيم \" [3]\n" +
                "\n" +
                "257- وقال صلى الله عيه وسلم  :\" لأن أقول سبحان الله ، والحمد لله ،ولا إله إلا الله ، والله أكبر ،أحب إلى مما طلعت عليه الشمس \" [4]\n" +
                "\n" +
                "258- وقال صلى الله عيه وسلم:\" أيعجز أحدكم أن يكسب كل يوم ألف حسنة\"فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة ؟ قال :\" يسبح مائة تسبيحة ، فيكتب له ألف حسنة أو يحط عنه ُ ألف خطيئة \" [5]\n" +
                "\n" +
                "259- \" من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة \" [6]\n" +
                "\n" +
                "260- وقال صلى الله عيه وسلم:\" يا عبد الله بن قيس ألا أدلك على كنز من كنوز الجنة ؟\" فقلت:بلى يا رسول الله ، قال :\" قل لا حول ولا قوة إلا بالله \"[7]\n" +
                "\n" +
                "261- وقال صلى الله عيه وسلم:\" أحب الكلام إلى الله أربعٌ : سبحان الله ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، لا يضرك بأيهنَّ بدأت \"[8]\n" +
                "\n" +
                "262- جاء أعربي إلى رسول الله صلى الله عيه وسلم فقال: علمني كلاماً أقوله : قال \" قل لا إله إلا الله وحده لا شريك لهً ،الله أكبرُ كبيراً ، والحمد لله كثيراً ، سبحان الله رب العالمين ،لا حول ولا قوة إلا بالله العزيز الحكيم \" قال فهؤلاء لربي فما لي ؟ قال : \" قل: اللهم اغفر لي ،وارحمني ،واهدني وارزقني \" [9]\n" +
                "\n" +
                "263- كان الرجل إذا أسلم علمه النبي صلى الله عليه وسلم الصلاة ثم أمره أن يدعو بهؤلاء الكلمات :\" اللهم اغفر لي، وارحمني ،واهدني ، وعافني وارزقني \"[10]\n" +
                "\n" +
                "264- \" إن أفضل الذكر لا إله إلا الله \"[11] .\n" +
                "\n" +
                "265- \" الباقيات الصالحات : سبحان الله والحمد لله ، ولا إله إلا الله ،والله أكبر ،و لا حول ولا قوة إلا بالله \"[12]\n" +
                "\n" +
                "1- البخاري 7/168 ومسلم 4/ 2071 ، وانظر :فضل من قالها مائة مرة إذا أصبح وإذا أمسى  \n" +
                "\n" +
                "2- البخاري 7/67 ومسلم بلفظه 4/2071 وانظر فضل من قالها في اليوم مائة مرة\n" +
                "\n" +
                "3- البخاري 7/167ومسلم 4/2072\n" +
                "\n" +
                "4- مسلم 4/2072\n" +
                "\n" +
                "5- مسلم 4/2073\n" +
                "\n" +
                "6- أخرجه الترمذي 5/511 والحاكم 1/501 وصححه ووافقه الذهبي ، وانظر صحيح الجامع 5/531 وصحيح الترمذي 3/160 .\n" +
                "\n" +
                "7- البخاري مع الفتح 11/ 213 ومسلم 4/2076\n" +
                "\n" +
                "8- مسلم 3/1685\n" +
                "\n" +
                "9- مسلم 4/ 2072 وزاد أبو داود : فلما ولى الأعرابي قال النبي صلى الله عليه وسلم :\" لقد ملأ يديه من الخير \"1/ 220 .\n" +
                "\n" +
                "10- مسلم 4/2073 وفي رواية لمسلم \" فإن هؤلاء تجمع لك ديناك وآخرتك \"\n" +
                "\n" +
                "11- الترمذي 5/462 وابن ماجه 2/1249 والحاكم 1/503 وصححه ووافقه الذهبي وانظر صحيح الجامع 1/ 362\n" +
                "\n" +
                "12- أحمد برقم 513 بترتيب أحمد شاكر وإسناده صحيح وانظر مجمع الزوائد 1/297، وعزاه ابن حجر في بلوغ المرام من رواية أبي سعيد إلىالنسائي وقال :صححه ابن حبان والحاكم"));
        HomeRv_item_0.add(new Model("كيف كان النبي صلى الله عليه وسلم يسبح ؟", "#5a5a5a", "266- عن عبد الله بن عمرو رضي الله عنهما قال : \" رأيت النبي صلى الله عليه وسلم يعقد التسبيح بيمينه \"[1]\n" +
                "\n" +
                "1- أخرجه أبو داود بلفظه 2/81 والترمذي 5/521 وانظر صحيح الجامع 4/271 برقم 4865"));
        HomeRv_item_0.add(new Model("من أنواع الخير والآداب الجامعة", "#5a5a5a", "267- \" إذا كان جنح الليل – أو أمسيتم – فكفوا صبيانكم ؛ فإن الشياطين تنتشر حينئذ ، فإذا ذهب ساعة من الليل فخلوهم ،وأغلقوا الأبواب واذكروا اسم الله ؛ فإن الشيطان لا يفتح باباً مغلقاً ، وأوكوا قربكم واذكروا اسم الله ، وخمروا آنيتكم واذكروا اسم الله ، ولو أن تعرضوا عليها شيئاً ، وأطفئوا مصابيحكم \"[1]\n" +
                "\n" +
                "1- البخاري مع الفتح 10/ 88 ومسلم 3/1595.\n" +
                "\n" +
                "وصلى الله وسلم وبارك على نبينا محمد وعلى آله وأصحابه أجمعين ."));


        return HomeRv_item_0;
    }

    public ArrayList<Model> HomeRv_item_1() {
        ArrayList<Model> HomeRv_item_1 = new ArrayList<>();
        HomeRv_item_1.add(new Model("أحاديث عامة", "#00878f",
                "\"(سُئِلَتْ عائِشةُ عن خُلُقِ رسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فقالَتْ: كان خُلُقُه القُرآنَ)\"\n" +
                        "\n" +
                        "----------------------------------------------------"));
        HomeRv_item_1.add(new Model("أحاديث عن الصدق", "#00878f", ""));
        HomeRv_item_1.add(new Model("أحاديث عن الماء", "#00878f", ""));
        HomeRv_item_1.add(new Model("أحاديث عن العلم", "#00878f", ""));


        return HomeRv_item_1;
    }

    public ArrayList<Model> HomeRv_item_2() {
        ArrayList<Model> HomeRv_item_2 = new ArrayList<>();
        HomeRv_item_2.add(new Model("\uD83C\uDF38 أحب الأعمال إلى الله \uD83C\uDF38", "#66412d", "عن عبدالله بن مسعود رضي الله عنه قال: سألت النبي صلى الله عليه وسلم: أي العمل أحب إلى الله؟ قال: (الصلاة على وقتها)، قال: ثم أي؟ قال: (ثم بر الوالدين) قال: ثم أي؟ قال: (الجهاد في سبيل الله)" +
                "\n" +
                " رواه البخاري ومسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 كلمتان حبيبتان إلى الرحمن \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن، سبحان الله وبحمده، سبحان الله العظيم)" +
                "\n" +
                " رواه البخاري ومسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 فضل صلاة سنّة الفجر \uD83C\uDF38", "#66412d", "عن عائشة رضي الله عنها عن النبي صلى الله عليه وسلم قال: (ركعتا الفجر خير من الدنيا وما فيها)"
                + "\n" + " رواه مسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 إنما الأعمال بالنيات \uD83C\uDF38", "#66412d", "عن عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه)\n" +
                " رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 فضل الصلاة على رسول الله \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من صلى على صلاة واحدة صلى الله عليه عشراً) \n" +
                "رواه مسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 اللغو في صلاة الجمعة \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إذا قلت لصاحبك: أنصت، يوم الجمعة والإمام يخطب، فقد لغوت) \n" +
                "رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 التحذير من الكذب على رسول الله \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من كذب علي متعمداً فليتبوأ مقعده من النار) \n" +
                "رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 كل امتي يدخلون الجنة إلا من.. \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (كل أمتي يدخلون الجنة إلا من أبى) قالوا: يا رسول الله: ومن يأبى؟ قال: (من أطاعني دخل الجنة، ومن عصاني فقد أبى) \n" +
                "رواه البخاري\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 المؤمن القوي والمؤمن الضعيف \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدَر الله وما شاء فعل، فإن لو تفتح عمل الشيطان)\n" +
                " رواه مسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 فضل إحصاء أسماء الله الحسنى \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إن لله تسعة وتسعين اسما مائة إلا واحدا، من أحصاها دخل الجنة)\n" +
                " رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 رحمة الله عز وجل \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: قال الله عز وجل: (سبقت رحمتي غضبي)\n" +
                " رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 لا يؤمن أحدكم حتى أكون.. \uD83C\uDF38", "#66412d", "عن أنس رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال: (لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين) \n" +
                "رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 لا يؤمن أحدكم حتى .. \uD83C\uDF38", "#66412d", "عن أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم قال: (لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه) \n" +
                "رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 خيركم من .. \uD83C\uDF38", "#66412d", "عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (خيركم من تعلم القرآن وعلمه) \n" +
                "رواه البخاري\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 إن الله يرفع بهذا الكتاب أقواما \uD83C\uDF38", "#66412d", "عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (إن الله يرفع بهذا الكتاب أقواما، ويضع به آخرين) \n" +
                "رواه مسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 أقرا القرآن في شهر \uD83C\uDF38", "#66412d", "عن عبد الله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم (اقرإ القرآن في شهر) قلت: إني أجد قوة حتى قال: (فاقرأه في سبع ولا تزد على ذلك) \n" +
                "رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 لا حسد إلا في اثنتين \uD83C\uDF38", "#66412d", "عن عبد الله بن عمر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (لا حسد إلا في اثنتين: رجل آتاه الله القرآن فهو يقوم به آناء الليل وآناء النهار، ورجل آتاه الله مالاً فهو ينفقه آناء الليل وآناء النهار) \n" +
                "رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 لا تجعلوا بيوتكم مقابر \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (لا تجعلوا بيوتكم مقابر، إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة)\n" +
                " رواه مسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 من قرأ بالآيتين من آخر سور البقرة \uD83C\uDF38", "#66412d", "عن ابن مسعود رضي الله عنه قال: قال النبي صلى الله عليه وسلم: (من قرأ بالآيتين من آخر سور البقرة في ليلة كفتاه) \n" +
                "رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 من حفظ عشر آيات من أول سورة الكهف \uD83C\uDF38", "#66412d", "عن أبي الدرداء رضي الله عنه أن النبي صلى الله عليه وسلم قال: (من حفظ عشر آيات من أول سورة الكهف عُصم من الدجال)\n" +
                " رواه مسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 من يرد الله به خيرا يفقهه في الدين \uD83C\uDF38", "#66412d", "عن معاوية بن أبي سفيان رضي الله عنهما قال: سمعت النبي صلى الله عليه وسلم يقول: (من يرد الله به خيرا يفقهه في الدين)\n" +
                " رواه البخاري ومسلم\n"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 من سلك طريقاً يلتمس فيه علماً \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من سلك طريقاً يلتمس فيه علماً سهَّل الله له به طريقاً إلى الجنة)" + "\n" + "رواه مسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 اجتنبوا السبع الموبقات \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (اجتنبوا السبع الموبقات)، قالوا: يا رسول الله وما هن؟ قال: (الشرك بالله، والسحر، وقتل النفس التي حرم الله إلا بالحق، وأكل الربا، وأكل مال اليتيم، والتولي يوم الزحف، وقذف المحصنات المؤمنات الغافلات) " + "\n" + "رواه البخاري ومسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 أكبر الكبائر \uD83C\uDF38", "#66412d", "عن أبي بكرة رضي الله عنه قال: قال النبي صلى الله عليه وسلم: (أكبر الكبائر: الإشراك بالله، وعقوق الوالدين، وشهادة الزور) " + "\n" + "رواه البخاري ومسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 من مات لا يشرك بالله شيئا دخل الجنة \uD83C\uDF38", "#66412d", "\n" +
                "عن جابر بن عبدالله رضي الله عنهما قال: قال النبي صلى الله عليه وسلم: (من مات لا يشرك بالله شيئا دخل الجنة، ومن مات يشرك بالله شيئا دخل النار) \n" + "\n" + "رواه مسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 إن بين الرجل وبين الشرك والكفر .. \uD83C\uDF38", "#66412d", "عن جابر رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (إن بين الرجل وبين الشرك والكفر ترك الصلاة) " + "\n" + "رواه مسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 من ترك صلاة العصر حَبِط عملُه \uD83C\uDF38", "#66412d", "عن بريدة بن الحُصيب رضي الله عنه عن النبي صلى الله عليه وسلم قال: (من ترك صلاة العصر حَبِط عملُه) " + "\n" + "رواه البخاري"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 الظلم ظلمات يوم القيامة \uD83C\uDF38", "#66412d", "عن عبدالله بن عمر بن الخطاب رضي الله عنهما عن النبي صلى الله عليه وسلم قال: (الظلم ظلمات يوم القيامة) " + "\n" + "رواه البخاري ومسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 أتدرون ما الغيبة؟ \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (أتدرون ما الغيبة؟) قالوا: الله ورسوله أعلم. قال: (ذكرك أخاك بما يكره) قيل: أرأيت إن كان في أخي ما أقول؟ قال: (إن كان فيه ما تقول فقد اغتبته، وإن لم يكن فيه ما تقول فقد بهته) " + "\n" + "رواه مسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 من حمل علينا السلاح فليس منا \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من حمل علينا السلاح فليس منا، ومن غشنا فليس منا) " + "\n" + "رواه مسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 لَعْنُ المؤمنٍ كقتلهِ \uD83C\uDF38", "#66412d", "عن ثابت بن الضحاك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (لَعْنُ المؤمن كقتله) " + "\n" + "رواه البخاري ومسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 إياكم والظن \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إياكم والظن، فإن الظن أكذب الحديث، ولا تحسسوا، ولا تجسسوا، ولا تنافسوا، ولا تحاسدوا، ولا تباغضوا، ولا تدابروا، وكونوا عباد الله إخوانا) " + "\n" + "رواه البخاري ومسلم"));
        HomeRv_item_2.add(new Model("\uD83C\uDF38 من لا يَرحم لا يُرحم \uD83C\uDF38", "#66412d", "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (من لا يَرحم لا يُرحم)" + "\n" + "رواه البخاري ومسلم"));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));
        HomeRv_item_2.add(new Model("", "#66412d", "" + "\n" + ""));


        return HomeRv_item_2;
    }


}
